const translates = {
  ying: "影",
  ying_info: "当此牌进入弃牌堆后，销毁之。",

  xumou: "蓄谋",
  xumou_info:
    "你将一张手牌扣置于你的判定区内，此类牌可以被弃置、获得、移动等；你的判定阶段开始时，若你的判定区内有蓄谋牌，你按置入顺序（后置入的先处理）依次处理蓄谋牌：1.使用这张蓄谋牌，然后本阶段不能再使用牌名与之相同的蓄谋牌；2.将你判定区内所有蓄谋牌置入弃牌堆。",

  jsrg_jiangwei: "合姜维",
  jsrg_jiangwei_prefix: "合",
  jsrgjinfa: "矜伐",
  jsrgjinfa_info:
    "出牌阶段限一次，你可以展示一张手牌，然后令所有体力上限不大于你的角色议事，若结果与此牌颜色：相同，你令其中至多两名角色将手牌摸至体力上限；不同，你获得两张【影】。然后若没有其他角色与你意见相同，你可以变更势力。",
  jsrgfumou: "复谋",
  jsrgfumou_info:
    "魏势力技，议事结束后：与你意见不同的角色本回合不能使用或打出与其意见牌颜色相同的牌；你可以将一张【影】当【出其不意】对一名与你意见不同的角色使用。",
  jsrgxuanfeng: "选锋",
  jsrgxuanfeng_info:
    "蜀势力技，你可以将一张【影】当无距离次数限制的刺【杀】使用。",
}

export default translates
