const characterIntro = {
  caozhang:
    "曹彰（189年－223年8月1日），字子文。沛国谯县（安徽亳州）人。魏武帝曹操与武宣卞皇后所生第二子、魏文帝曹丕之弟、陈王曹植之兄。<br><br>曹彰武艺过人，曹操问诸子志向时自言“好为将”，因此得到曹操的赞赏。其胡须黄色，被曹操称为“黄须儿”。弱冠前喜搏猛虎，臂力过人、不善文章。建安二十一年（216年），封鄢陵侯。建安二十三年（218年），曹彰受封为北中郎将、行骁骑将军，率军征讨乌桓，又降服辽东鲜卑大人轲比能。曹丕即位后，曹彰与诸侯就国。黄初二年（221年）进爵为公。次年被封为任城王。<br><br>黄初四年（223年），曹彰到洛阳朝见，其间得急病而逝于府邸。",
  re_yiji:
    "伊籍，字机伯，生卒年不详，兖州山阳郡（今山东金乡县）人，三国时期蜀汉官员。年少时依附于同乡刘表。刘备落难到荆州时，伊籍时常拜访，托请刘备照顾。建安十三年（208年），刘表病死，伊籍便转投刘备，一起渡江南下。建安十六年（211年），刘备入蜀帮助刘璋，伊籍亦有跟随。随后刘备和刘璋双方决裂。建安十九年（214年），刘备平定益州，任命伊籍为左将军从事中郎，其待遇次于简雍、孙乾等。后升任昭文将军，并与诸葛亮、法正、刘巴、李严共同编制《蜀科》。",
}

export default characterIntro
