const characterIntro = {
  lidian:
    "李典（生卒年不详），字曼成。山阳郡钜野县（今山东巨野）人。<br><br>李典年少时好学，不爱好征战，于是拜师读《春秋左氏传》，熟读各种书籍。建安十九年（214年）十月，曹操自合肥还，李典与张辽、乐进在合肥驻扎。建安二十年（215年）八月，孙权指挥十万大军围攻合肥，张辽打算按照教谕与李典一同出城交战。乐进、李典、张辽平常都互不和睦。张辽担心李典不从，李典慷慨的说：“这是国家大事，要看你的计策是否好，（如果可行）我怎么能够因为私怨而不顾大局呢！”于是，率领部众与张辽一起打败赶走了孙权。<br><br>李典爱好学问，注重儒雅，从来不和别的将领争抢功劳。尊敬贤士大夫，恐怕有礼节不周的地方，军营的官兵都认为他是长者。三十六岁时去世。",
  xushu:
    "徐庶，字元直。颍川郡长社县（今河南许昌长葛东）人。东汉末年刘备帐下谋士，后归曹操，病逝于曹魏。<br><br>徐庶本名徐福不是这个徐福，为寒门子弟。早年为人报仇，获救后改名徐庶，拜师求道。后与同郡石韬（字广元，与徐庶同期的一名谋士，与徐庶交好）避难于荆州，与司马徽、诸葛亮、崔州平等道友来往密切。刘备屯驻新野时，徐庶前往投奔，并向刘备推荐诸葛亮。徐庶南下时因母亲被曹操所掳获，徐庶不得已辞别刘备，进入曹营。后来此事被艺术加工为“徐庶进曹营，一言不发”等歇后语，被广为流传。而徐庶也成为孝子的典范被加以称赞。魏文帝时，徐庶官至右中郎将、御史中丞。在诸葛亮北伐行军至陇右（今陕甘边界六盘山西部地区）之时听见徐庶与石韬在曹魏不被重用的消息时曾感叹道：“魏殊多士邪！何彼二人不见用乎？（魏国谋士这么多吗？为什么不重用徐庶石韬二人呢？）”",
}

export default characterIntro
