const characterIntro = {
  wangji:
    "字伯舆，东莱曲城人。三国时期魏国将领。王基文武兼备，才高于世，德溥于时，深得司马懿、司马师、司马昭的器重，尤其在南征毌丘俭，文钦之乱，东征诸葛诞之叛大规模军事活动中，王基与司马师、司马昭结下了深厚的军友情谊。魏景元二年王基去世，追赠司空，谥号为景侯。<br><br>在《三国杀》中，王基是第一个从SP包转正的武将。",
  kuailiangkuaiyue:
    "蒯良，字子柔，南郡中庐人。归刘表。蒯良为刘表定下安抚荆楚的政治方向，佐其成业，被刘表誉为“雍季之论”。之后，蒯良就被刘表擢升为主簿。其后蒯良的生平，就不得而知了，《三国志》亦没有记载其卒年，但从赤壁之战前夕他没有出场看应已不在世。《三国演义》中，最晚在刘备获得的卢时就已去世。所以他根本没见过曹操，为什么是魏国的<br><br>蒯越（？－214年），字异度，襄阳中庐（今湖北襄阳西南）人。东汉末期人物，演义中为蒯良之弟。原本是荆州牧刘表的部下，曾经在刘表初上任时帮助刘表铲除荆州一带的宗贼（以宗族、乡里关系组成的武装集团）。刘表病逝后与刘琮一同投降曹操，后来官至光禄勋。<br><br>筷子兄弟",
  yanyan:
    "严颜，东汉末年武将，初为刘璋部下，担任巴郡太守。建安十九年，刘备进攻江州，严颜战败被俘，张飞对严颜说：“大军至，何以不降而敢拒战？”严颜回答说：“卿等无状，侵夺我州，我州但有断头将军，无降将军也！”张飞生气，命左右将严颜牵去砍头。严颜表情不变地说：“砍头便砍头，何为怒邪！”张飞敬佩严颜的勇气，遂释放严颜并以严颜为宾客，之后的事迹不在正史中出现。",
  wangping:
    "王平（?—248年），字子均，巴西郡宕渠（今四川省达州市渠县）人，籍贯益州。三国蜀汉后期名将。<br><br>王平幼时寄养于外祖父何氏之家，所以又叫何平，后来改回本来的王姓。215年，巴西郡七姓夷王朴胡、賨邑侯杜濩举巴夷、賨民依附曹操，王平随同至洛阳（因此王平或为汉化賨人），任校尉。后随曹操出征汉中，转投刘备，被封为牙门将、裨将军。228年正月，蜀参军马谡与魏大将张郃大战于街亭前，置军队于城外山上，放弃街亭重镇。231年，诸葛亮再次北伐，其领兵围祁山南屯，司马懿命张郃率数万之众猛攻王平，其仍坚守不动，使张郃毫无办法。234年春，诸葛亮积劳成疾，病卒于武功军中。因王平制止蜀军内乱，升任后典军安汉将军。<br><br>237年，王平进封安汉侯，代车骑将军吴懿守汉中。次年，大将军蒋琬屯军沔阳，意欲再次北伐，其“为前护军，署蒋琬府事”。243年，蒋琬还驻涪城（今四川绵阳市），任王平为前监军、镇北大将军，统汉中。次年，其亲率千余人占领山头，居高临下，痛击魏军。此时，来自涪城、成都的援军火速赶到，前后夹攻，致魏军大败而回。248年，王平病逝。",
  luji: "陆绩（约188年-约219年），字公纪，吴郡吴县（今江苏苏州）人。庐江太守陆康之子，东汉末年大臣。<br><br>陆绩幼读《诗》《书》，长习《礼》《易》，博学多识，天文、历法、算数等无不涉猎。少有孝名，在袁术家中作客，席上有橘，陆绩为母亲能够吃到橘子，私取三枚藏于怀里，后人将其编入《二十四孝》。后孙策与张昭、张纮等人共论当时纷乱局势，唯陆绩年少直言，以为诸人所论唯知尚武，不思文德。孙权继位后，任陆绩为奏曹掾，但对陆绩常直言政事不无忌惮，更担心不能为己所用，遂外放为郁林（今属广西）太守，加偏将军。陆绩到任后廉洁勤政，体谅民艰，大兴水利，改善民生。因病卸任归吴时，除简单行装别无余财，船工担心船轻恐覆，其令搬一重石压舱，归后置于宅前，于建安二十四年（219年）卒，年仅三十二岁。<br><br>陆绩研习经籍，博学多识，尤善星历算术，力主浑天之义，反对盖天之说。并作《浑天图》。另有《周易注》《太玄注》，均佚。今存《述玄》一文，辑入《全三国文》中。",
  sunliang:
    "孙亮（243~260），字子明，吴国第二任皇帝，孙权第七子，史称会稽王、吴少帝、吴废帝。<br><br>母亲潘皇后有孕时曾梦有人将龙头授于自己，自己用下衣接住，不久就在建业宫内殿生下孙亮。孙亮年幼时便聪明颖悟，有成人的判断能力，与傅相会面举止合乎礼节，大臣都很看重他。孙权对孙亮母子十分宠爱；孙鲁班因为与太子孙和的母亲王夫人不和，便与孙亮母子交好，怂恿孙权将她夫家全尚的女儿嫁给孙亮为妃。250年，太子孙和被废，孙亮被立为太子，252年登基为帝，同年吴国取得东兴大捷。257年亲政，但一年后因不满权臣孙綝专权，密谋除之，因泄密而事败，被废为会稽王。260年再被贬为候官侯，在前往封地途中自杀（一说被毒杀），终年18岁。西晋太康年间，原先任职吴国的官员戴显将孙亮的遗骨葬在赖乡。",
  xuyou:
    "许攸（？－204年），字子远，南阳（治今河南南阳）人。本为袁绍帐下谋士，官渡之战时其家人因犯法而被收捕，许攸因此背袁投曹，并为曹操设下偷袭袁绍军屯粮之所乌巢的计策，袁绍因此而大败于官渡。后许攸随曹操平定冀州，因自恃其功而屡屡口出狂言，终因触怒曹操而被杀。",
  luzhi:
    "卢植，字子干，涿郡涿县人。东汉末年经学家、将领。刘备和公孙瓒都曾拜他为师。卢植身材高大，性格刚毅，文武双全，曾师从太尉陈球、大儒马融等，为郑玄、管宁、华歆的同门师兄，先后担任九江、庐江太守，平定蛮族叛乱。后与马日䃅、蔡邕等一起在东观校勘儒学经典书籍，并参与续写《汉记》，另著有《尚书章句》《三礼解诂》等。黄巾起义时，卢植拜中郎将，率军与张角交战，后被诬陷下狱，经营救后复任为尚书。后来，他因为上谏激怒董卓被免官，隐居在上谷军都山，191年袁绍取得冀州，拜卢植为军师。第二年卢植去世，临终要求薄葬。207年曹操北伐乌桓经过卢植墓，撰文赞扬他，并派人为他扫墓。",

  haozhao:
    "郝昭（生卒年不详），字伯道，太原人，中国东汉末年至曹魏初年著名将领。郝昭少年从军，屡立战功，逐渐晋升为杂号将军，后受曹真的推荐镇守陈仓，防御蜀汉。太和二年（228），诸葛亮率军北伐，为郝昭所阻，劝降不成，昼夜相攻二十余日后被迫退军。魏明帝因此封其为关内侯。不久因染疾而病死。郝昭临终前留下遗令告诫其子郝凯务必薄葬。",
  chendao:
    "陈到（？－247年左右），字叔至，豫州汝南（今河南驻马店平舆县）人。三国时期蜀汉将领，刘备帐下白毦兵统领，名位常亚于赵云，以忠勇著称。蜀汉建兴年间，任征西将军、永安都督，封亭侯。在任期间去世。<br><br>《三国志·蜀书十五·邓张宗杨传第十五》：“叔至名到，汝南人也。自豫州随先主，名位常亚赵云，俱以忠勇称。建兴初，官至永安都督、征西将军，封亭侯。”",
  zhugezhan:
    "诸葛瞻（227年—263年），字思远，琅邪阳都（今山东沂南县）人。三国时期蜀汉大臣，蜀汉丞相诸葛亮之子，袭爵武乡侯，官至卫将军。邓艾伐蜀时，率军防御绵竹，不听属下劝谏，未能占敌先机，出城迎战，结果兵败被杀，绵竹随后失守。后主刘禅投降，蜀汉灭亡。",
  zhoufei:
    "周妃是三国时期周瑜与小乔之女，名不详，有说为周彻，为吴国太子孙登的王妃。",
  lukang:
    "陆抗（226年-274年），字幼节，吴郡吴县（今江苏省苏州市）人。三国时期吴国名将。<br><br>赤乌八年（245年），袭封江陵县侯，起家建武校尉，统领父亲陆逊五千部众。赤乌九年，迁立节中郎将，把守柴桑。建兴元年，拜奋威将军。太平二年，拜柴桑督，后因功迁征北将军。吴永安二年，迁镇军将军，镇守西陵。末帝孙皓即位后，担任镇军大将军、都督西陵、信陵、夷道、乐乡、公安诸军事，驻防于乐乡（今湖北江陵西南），遥领益州牧。凤凰元年，击退晋将羊祜进攻，攻杀叛将步阐，加拜都护，累迁大司马、荆州牧。凤凰三年（274年），去世，终年四十九岁。<br><br>陆抗与父亲陆逊皆是吴国的中流砥柱，并称“逊抗”，被称为“吴国最后的名将”。唐德宗时，两人同时位列武成王庙六十四将。",
  yuanshu:
    "袁术（？－199年），字公路，汝南汝阳（今河南商水西南）人，司空袁逢之嫡次子，袁绍之从弟。少有侠气，进入仕途后逐步升为虎贲中郎将，与袁绍一同依附大将军何进，是诛杀十常侍的主要参与者之一。董卓进京后，以袁术为后将军，袁术因畏祸而出奔南阳，南阳太守为孙坚所杀，于是袁术被刘表表为南阳太守，并接受孙坚归附。初平元年（190年）与袁绍、曹操等同时起兵，共讨董卓，支援孙坚击破董卓军逼近洛阳，在得知孙坚私藏传国玉玺后将其夺取（演义中是后来孙策进献以换取兵权）。后与袁绍对立，孙坚在攻刘表时阵亡，袁术在袁绍、曹操、刘表的夹攻下战败，率众奔九江，割据扬州，并利用孙坚之子孙策去攻打九江、庐江等地。<br><br>建安二年（197年）袁术称帝，建号仲氏，但未被普遍承认，与吕布结亲遭拒，孙策也借机叛离。此后袁术奢侈荒淫，横征暴敛，使江淮地区残破不堪，民多饥死，部众离心，先后为吕布、曹操所破，元气大伤，不得不尝试投靠袁绍，却被曹操阻住。后于建安四年（199年）呕血而死。",
  zhangxiu:
    "张绣是东汉末年军阀，骠骑将军张济之侄。时值东汉末年，宦官作乱，外戚、大将军何进欲诛十常侍，招来董卓进京。张济随军。后董卓被杀，张济部队缺粮，张济率军进攻穰城时中流矢而死，留有寡嫂邹氏。部队由张绣接管。后张绣先投入曹操门下，但因曹操贪恋张绣邹氏之美貌，张绣在贾诩建议下毅然举兵反曹。在宛城之战中，张绣杀死了曹操长子曹昂、侄子曹安民和贴身保镖典韦。后在官渡之战时听从贾诩建议投奔曹操，被封为破羌将军、宣威侯。后又击败袁谭。最后在北征乌桓途中病逝（一说被逼死）。<br><br>民间戏剧中有张绣和赵云的枪法都是同一师傅所教的说法。",
}

export default characterIntro
