const characterIntro = {
  wangji:
    "字伯舆，东莱曲城人。三国时期魏国将领。王基文武兼备，才高于世，德溥于时，深得司马懿、司马师、司马昭的器重，尤其在南征毌丘俭，文钦之乱，东征诸葛诞之叛大规模军事活动中，王基与司马师、司马昭结下了深厚的军友情谊。魏景元二年王基去世，追赠司空，谥号为景侯。<br><br>在《三国杀》中，王基是第一个从SP包转正的武将。",
  kuailiangkuaiyue:
    "蒯良，字子柔，南郡中庐人。归刘表。蒯良为刘表定下安抚荆楚的政治方向，佐其成业，被刘表誉为“雍季之论”。之后，蒯良就被刘表擢升为主簿。其后蒯良的生平，就不得而知了，《三国志》亦没有记载其卒年，但从赤壁之战前夕他没有出场看应已不在世。《三国演义》中，最晚在刘备获得的卢时就已去世。所以他根本没见过曹操，为什么是魏国的<br><br>蒯越（？－214年），字异度，襄阳中庐（今湖北襄阳西南）人。东汉末期人物，演义中为蒯良之弟。原本是荆州牧刘表的部下，曾经在刘表初上任时帮助刘表铲除荆州一带的宗贼（以宗族、乡里关系组成的武装集团）。刘表病逝后与刘琮一同投降曹操，后来官至光禄勋。<br><br>筷子兄弟",
  yanyan:
    "严颜，东汉末年武将，初为刘璋部下，担任巴郡太守。建安十九年，刘备进攻江州，严颜战败被俘，张飞对严颜说：“大军至，何以不降而敢拒战？”严颜回答说：“卿等无状，侵夺我州，我州但有断头将军，无降将军也！”张飞生气，命左右将严颜牵去砍头。严颜表情不变地说：“砍头便砍头，何为怒邪！”张飞敬佩严颜的勇气，遂释放严颜并以严颜为宾客，之后的事迹不在正史中出现。",
  wangping:
    "王平（?—248年），字子均，巴西郡宕渠（今四川省达州市渠县）人，籍贯益州。三国蜀汉后期名将。<br><br>王平幼时寄养于外祖父何氏之家，所以又叫何平，后来改回本来的王姓。215年，巴西郡七姓夷王朴胡、賨邑侯杜濩举巴夷、賨民依附曹操，王平随同至洛阳（因此王平或为汉化賨人），任校尉。后随曹操出征汉中，转投刘备，被封为牙门将、裨将军。228年正月，蜀参军马谡与魏大将张郃大战于街亭前，置军队于城外山上，放弃街亭重镇。231年，诸葛亮再次北伐，其领兵围祁山南屯，司马懿命张郃率数万之众猛攻王平，其仍坚守不动，使张郃毫无办法。234年春，诸葛亮积劳成疾，病卒于武功军中。因王平制止蜀军内乱，升任后典军安汉将军。<br><br>237年，王平进封安汉侯，代车骑将军吴懿守汉中。次年，大将军蒋琬屯军沔阳，意欲再次北伐，其“为前护军，署蒋琬府事”。243年，蒋琬还驻涪城（今四川绵阳市），任王平为前监军、镇北大将军，统汉中。次年，其亲率千余人占领山头，居高临下，痛击魏军。此时，来自涪城、成都的援军火速赶到，前后夹攻，致魏军大败而回。248年，王平病逝。",
  luji: "陆绩（约188年-约219年），字公纪，吴郡吴县（今江苏苏州）人。庐江太守陆康之子，东汉末年大臣。<br><br>陆绩幼读《诗》《书》，长习《礼》《易》，博学多识，天文、历法、算数等无不涉猎。少有孝名，在袁术家中作客，席上有橘，陆绩为母亲能够吃到橘子，私取三枚藏于怀里，后人将其编入《二十四孝》。后孙策与张昭、张纮等人共论当时纷乱局势，唯陆绩年少直言，以为诸人所论唯知尚武，不思文德。孙权继位后，任陆绩为奏曹掾，但对陆绩常直言政事不无忌惮，更担心不能为己所用，遂外放为郁林（今属广西）太守，加偏将军。陆绩到任后廉洁勤政，体谅民艰，大兴水利，改善民生。因病卸任归吴时，除简单行装别无余财，船工担心船轻恐覆，其令搬一重石压舱，归后置于宅前，于建安二十四年（219年）卒，年仅三十二岁。<br><br>陆绩研习经籍，博学多识，尤善星历算术，力主浑天之义，反对盖天之说。并作《浑天图》。另有《周易注》《太玄注》，均佚。今存《述玄》一文，辑入《全三国文》中。",
  sunliang:
    "孙亮（243~260），字子明，吴国第二任皇帝，孙权第七子，史称会稽王、吴少帝、吴废帝。<br><br>母亲潘皇后有孕时曾梦有人将龙头授于自己，自己用下衣接住，不久就在建业宫内殿生下孙亮。孙亮年幼时便聪明颖悟，有成人的判断能力，与傅相会面举止合乎礼节，大臣都很看重他。孙权对孙亮母子十分宠爱；孙鲁班因为与太子孙和的母亲王夫人不和，便与孙亮母子交好，怂恿孙权将她夫家全尚的女儿嫁给孙亮为妃。250年，太子孙和被废，孙亮被立为太子，252年登基为帝，同年吴国取得东兴大捷。257年亲政，但一年后因不满权臣孙綝专权，密谋除之，因泄密而事败，被废为会稽王。260年再被贬为候官侯，在前往封地途中自杀（一说被毒杀），终年18岁。西晋太康年间，原先任职吴国的官员戴显将孙亮的遗骨葬在赖乡。",
}

export default characterIntro
