const characterIntro = {
  wangji:
    "字伯舆，东莱曲城人。三国时期魏国将领。王基文武兼备，才高于世，德溥于时，深得司马懿、司马师、司马昭的器重，尤其在南征毌丘俭，文钦之乱，东征诸葛诞之叛大规模军事活动中，王基与司马师、司马昭结下了深厚的军友情谊。魏景元二年王基去世，追赠司空，谥号为景侯。<br><br>在《三国杀》中，王基是第一个从SP包转正的武将。",
  kuailiangkuaiyue:
    "蒯良，字子柔，南郡中庐人。归刘表。蒯良为刘表定下安抚荆楚的政治方向，佐其成业，被刘表誉为“雍季之论”。之后，蒯良就被刘表擢升为主簿。其后蒯良的生平，就不得而知了，《三国志》亦没有记载其卒年，但从赤壁之战前夕他没有出场看应已不在世。《三国演义》中，最晚在刘备获得的卢时就已去世。所以他根本没见过曹操，为什么是魏国的<br><br>蒯越（？－214年），字异度，襄阳中庐（今湖北襄阳西南）人。东汉末期人物，演义中为蒯良之弟。原本是荆州牧刘表的部下，曾经在刘表初上任时帮助刘表铲除荆州一带的宗贼（以宗族、乡里关系组成的武装集团）。刘表病逝后与刘琮一同投降曹操，后来官至光禄勋。<br><br>筷子兄弟",
}

export default characterIntro
