import { lib, game, ui, get, ai, _status } from "wtk"

const translates = {
  re_caoren: "界曹仁",
  re_caoren_prefix: "界",
  rejushou: "据守",
  rejushou_info:
    "结束阶段，你可以翻面，然后摸四张牌并弃置一张手牌，若此牌为装备牌，则你改为使用之。",
  jiewei: "解围",
  jiewei_info:
    "你可以将装备区里的一张牌当【无懈可击】使用；当你翻面至正面朝上时，你可以弃置一张手牌，然后可以移动场上的一张牌。",

  re_xiahouyuan: "界夏侯渊",
  re_xiahouyuan_prefix: "界",
  reshensu: "神速",
  shensu4: "神速",
  reshensu_info:
    "你可以做出如下选择：1.跳过判定阶段和摸牌阶段；2.跳过出牌阶段并弃置一张装备牌；3.跳过弃牌阶段并翻面。你每选择一项，便视为使用一张无距离限制的【杀】。",

  re_huangzhong: "界黄忠",
  re_huangzhong_prefix: "界",
  reliegong: "烈弓",
  reliegong_info:
    "你使用【杀】可以选择距离不大于此【杀】点数的角色为目标。当你使用【杀】指定一名角色为目标后，你可以根据下列条件执行相应的效果：1.其手牌数不大于你的手牌数，其不能使用【闪】响应此【杀】；2.其体力值不小于你的体力值，此【杀】伤害+1。",

  re_weiyan: "界魏延",
  re_weiyan_prefix: "界",
  rekuanggu: "狂骨",
  rekuanggu_info: "当你对距离小于2的一名角色造成1点伤害后，你可以回复1点体力或摸一张牌。",
  qimou: "奇谋",
  qimou_info:
    "限定技，出牌阶段，你可以失去任意点体力，然后你于此阶段内计算与其他角色的距离-X，且你可以多使用X张【杀】（X为你以此法失去的体力值）。",

  re_xiaoqiao: "界小乔",
  re_xiaoqiao_prefix: "界",
  retianxiang: "天香",
  retianxiang_info:
    "当你受到伤害时，你可以弃置一张红桃手牌并选择一名其他角色，然后防止此伤害并选择一项：1.令来源对其造成1点伤害，然后其摸X张牌（X为其已损失的体力值且至多为5）；2.令其失去1点体力，然后其获得你弃置的牌。",

  re_zhoutai: "界周泰",
  re_zhoutai_prefix: "界",
  rebuqu: "不屈",
  rebuqu_bg: "创",
  rebuqu_info:
    "锁定技，当你处于濒死状态时，你将牌堆顶的一张牌置于你的武将牌上，称为“创”，若此牌的点数与已有的“创”点数均不同，则你将体力回复至1点，否则你将此牌置入弃牌堆。若你的武将牌上有“创”，你的手牌上限与“创”的数量相等。",
  fenji: "奋激",
  fenji_info: "一名角色的结束阶段，若其没有手牌，你可以令其摸两张牌，然后你失去1点体力。",

  re_zhangjiao: "界张角",
  re_zhangjiao_prefix: "界",
  releiji: "雷击",
  releiji_info:
    "当你使用或打出【闪】时，你可以令一名其他角色进行判定，若结果为：黑桃，你对其造成2点雷电伤害；梅花，你回复1点体力，对其造成1点雷电伤害。",

  re_yuji: "界于吉",
  re_yuji_prefix: "界",
  reguhuo: "蛊惑",
  reguhuo_info: `每回合限一次，你可以扣置一张手牌，将此牌当任意一张基本牌或普通锦囊牌使用或打出且其他角色可以进行质疑。若有其他角色质疑则翻开此牌，若为假，则此牌作废，否则质疑者获得${get.poptip("chanyuan")}。`,
  chanyuan: "缠怨",
  chanyuan_info: "锁定技，你不能质疑〖蛊惑〗；若你的体力值为1，你的其他技能失效。",

  re_dianwei: "界典韦",
  re_dianwei_prefix: "界",
  reqiangxi: "强袭",
  reqiangxi_info:
    "出牌阶段对每名角色限一次，你可以失去1点体力或弃置一张武器牌，对你攻击范围内的一名其他角色造成1点伤害。",

  re_xunyu: "界荀彧",
  re_xunyu_prefix: "界",
  rejieming: "节命",
  rejieming_info:
    "当你受到1点伤害后，你可以令一名角色摸两张牌，然后若其手牌数小于其体力上限，你摸一张牌。",

  re_sp_zhugeliang: "界卧龙诸葛",
  re_sp_zhugeliang_prefix: "界",
  rehuoji: "火计",
  rehuoji_info: "你可以将一张红色牌当【火攻】使用。",
  rekanpo: "看破",
  rekanpo_info: "你可以将一张黑色牌当【无懈可击】使用。",

  re_pangtong: "界庞统",
  re_pangtong_prefix: "界",
  relianhuan: "连环",
  relianhuan_info:
    "你可以将一张梅花手牌当【铁索连环】使用或重铸；你使用【铁索连环】可以多指定一名角色为目标。",
  reniepan: "涅槃",
  reniepan_info:
    "限定技，出牌阶段或当你处于濒死状态时，你可以弃置区域里的所有牌，复原武将牌，然后摸三张牌并将体力回复至3点。",

  jx_pangde: "界庞德",
  jx_pangde_prefix: "界",
  mashu: "马术",
  mashu_info: "锁定技，你计算与其他角色的距离-1。",
  jianchu: "鞬出",
  jianchu_info:
    "当你使用的【杀】指定目标后，你可以弃置该角色一张牌，若以此法弃置的牌：是装备牌，其不能使用【闪】响应此【杀】；不是装备牌，其获得此【杀】。",

  jx_yanwen: "界颜良文丑",
  jx_yanwen_prefix: "界",
  jx_shuangxiong: "双雄",
  jx_shuangxiong_info:
    "摸牌阶段开始时，你可以改为亮出牌堆顶两张牌，然后你获得其中一张且可以将与此牌颜色不同的手牌当【决斗】使用直到回合结束；当你因【决斗】受到伤害后，你获得此次【决斗】中其他角色打出的【杀】。",

  jx_yuanshao: "界袁绍",
  jx_yuanshao_prefix: "界",
  jx_luanji: "乱击",
  jx_luanji_info:
    "出牌阶段，你可以将两张手牌当【万箭齐发】使用（不能使用此回合发动本技能时已用过的花色）。当其他角色因响应你使用的【万箭齐发】而打出【闪】时，其摸一张牌。当你使用的【万箭齐发】结算结束后，若没有角色因此牌而受到过伤害，你摸一张牌。",
  xueyi: "血裔",
  xueyi_info: "主公技，锁定技，你的手牌上限+X（X为其他群势力角色数的两倍）。",

  jx_taishici: "界太史慈",
  jx_taishici_prefix: "界",
  jx_tianyi: "天义",
  jx_tianyi_info:
    "出牌阶段限一次，你可以拼点：若你赢，你本回合使用【杀】次数上限+1、目标上限+1、无距离限制。若你没赢，你本回合使用下一张牌时取消之并令唯一目标摸两张牌。",
  dangmo: "荡魔",
  dangmo_info:
    "当你使用牌结算后，若此牌目标与你本回合使用的上一张牌目标不完全相同，你可以对两张牌的重合目标各造成1点伤害。",

  jx_xuhuang: "界徐晃",
  jx_xuhuang_prefix: "界",
  jx_duanliang: "断粮",
  jx_duanliang1: "断粮",
  jx_duanliang_info:
    "你可以将一张黑色基本牌或黑色装备牌当【兵粮寸断】使用；你对手牌数不小于你的角色使用【兵粮寸断】无距离限制。",
  jiezi: "截辎",
  jiezi_info: "锁定技，若其他角色已跳过其此回合的摸牌阶段，其下一个任意阶段开始前，你摸一张牌。",

  jx_menghuo: "界孟获",
  jx_menghuo_prefix: "界",
  huoshou: "祸首",
  huoshou1: "祸首",
  huoshou2: "祸首",
  huoshou_info:
    "锁定技，【南蛮入侵】对你无效。当其他角色使用【南蛮入侵】指定目标后，你代替其成为此牌造成伤害的来源。",
  jx_zaiqi: "再起",
  jx_zaiqi_info:
    "弃牌阶段结束时，你可以令至多X名角色各选择一项（X为此回合内你放入弃牌堆的红色牌数量）：1.摸一张牌；2.令你回复1点体力。",

  jx_zhurong: "界祝融",
  jx_zhurong_prefix: "界",
  juxiang: "巨象",
  juxiang1: "巨象",
  juxiang2: "巨象",
  juxiang_info: "锁定技，【南蛮入侵】对你无效；当其他角色使用的【南蛮入侵】结算结束后，你获得之。",
  jx_lieren: "烈刃",
  jx_lieren_info:
    "当你使用【杀】指定目标后，你可以与目标角色拼点，若你赢，你获得其一张牌；若你没赢，你与其各收回对方此次拼点的牌。",

  jx_caopi: "界曹丕",
  jx_caopi_prefix: "界",
  jx_xingshang: "行殇",
  jx_xingshang_info: "当其他角色死亡时，你可以选择一项：1.获得其所有牌；2.回复1点体力。",
  jx_fangzhu: "放逐",
  jx_fangzhu_info:
    "当你受到伤害后，你可以令一名其他角色选择一项：1.摸X张牌，然后将武将牌翻面；2.弃置X张牌，然后失去1点体力。（X为你已损失的体力值）",
  songwei: "颂威",
  songwei2: "颂威",
  songwei_info: "主公技，其他魏势力角色的黑色判定牌生效后，其可以令你摸一张牌。",

  jx_sunjian: "界孙坚",
  jx_sunjian_prefix: "界",
  yinghun: "英魂",
  yinghun_info:
    "准备阶段，若你已受伤，你可以选择一名其他角色并选择一项：1.令其摸X张牌，然后其弃置一张牌；2.令其摸一张牌，然后其弃置X张牌（X为你已损失的体力值）。",
  polu: "破虏",
  polu_info:
    "当你杀死一名角色后或当你死亡后，你可以令任意名角色各摸X张牌（X为含本次在内你发动本技能的次数）。",

  jx_dongzhuo: "界董卓",
  jx_dongzhuo_prefix: "界",
  jx_jiuchi: "酒池",
  jx_jiuchi_info:
    "你可以将一张♠手牌当【酒】使用；当你因使用的【酒】【杀】而造成伤害后，你此回合“崩坏”失效。",
  roulin: "肉林",
  roulin_info:
    "锁定技，你对女性角色使用的【杀】和女性角色对你使用的【杀】均需使用两张【闪】才能抵消。",
  benghuai: "崩坏",
  benghuai_info:
    "锁定技，结束阶段，若你不是体力值最小的角色，你选择一项：1.失去1点体力；2.减1点体力上限。",
  baonue: "暴虐",
  baonue2: "暴虐",
  baonue_info: "主公技，其他群势力角色造成伤害后，其可以令你进行判定，若结果为♠，你回复1点体力。",

  jx_lusu: "界鲁肃",
  jx_lusu_prefix: "界",
  jx_haoshi: "好施",
  jx_haoshi_info:
    "摸牌阶段，你可以多摸两张牌，然后手牌数唯一最多的角色将其一半手牌（向下取整）交给一名由你指定的手牌数最少的角色。",
  jx_dimeng: "缔盟",
  jx_dimeng_info:
    "出牌阶段限一次，你可以选择两名手牌数之差小于3的其他角色，这些角色依次可以使用至多三张手牌，然后双方交换手牌。",

  jx_jiaxu: "界贾诩",
  jx_jiaxu_prefix: "界",
  jx_wansha: "完杀",
  jx_wansha_info:
    "锁定技，你的回合内：除濒死角色外，所有其他角色的红色基本牌均视为【杀】，且使用时你摸两张牌。",
  jx_weimu: "帷幕",
  jx_weimu_info: "黑色锦囊牌对你无效；你可以将黑色非锦囊牌当【借刀杀人】使用。",
  luanwu: "乱武",
  luanwu_info:
    "限定技，出牌阶段，你可以令所有其他角色须对各自距离最近的角色使用一张【杀】，否则失去1点体力。",

  jx_dengai: "界邓艾",
  jx_dengai_prefix: "界",
  jx_tuntian: "屯田",
  jx_tuntian_info:
    "当你于回合外失去牌后，你可以进行判定，若结果为：♥，你获得此判定牌；非♥，你将生效后的判定牌置于你的武将牌上，称为“田”；你计算与其他角色的距离-X（X为“田”的数量）。",
  zaoxian: "凿险",
  zaoxian_info: `觉醒技，准备阶段，若“田”的数量不小于3，你减1点体力上限，然后获得${get.poptip("jixi")}。`,
  jixi: "急袭",
  jixi_info: "你可以将一张“田”当【顺手牵羊】使用。",

  jx_jiangwei: "界姜维",
  jx_jiangwei_prefix: "界",
  jx_tiaoxin: "挑衅",
  jx_tiaoxin_info:
    "出牌阶段限一次，你可以选择一名其他角色，然后除非其对你使用一张【杀】，否则你弃置其一张牌。",
  jx_zhiji: "志继",
  jx_zhiji_info: `觉醒技，准备阶段，若你没有手牌，你回复1点体力或摸两张牌，减1点体力上限，然后获得${get.poptip("jx_guanxing")}。`,

  jx_caiwenji: "界蔡文姬",
  jx_caiwenji_prefix: "界",
  jx_beige: "悲歌",
  jx_beige_info:
    "当一名角色受到【杀】造成的伤害后，你可以弃置一张牌，然后令其进行判定，若结果为：♥，其回复X点体力（X为其本次受到伤害值）；♦︎，其摸三张牌；♣，伤害来源弃置两张牌；♠，伤害来源翻面。",
  duanchang: "断肠",
  duanchang_info: "锁定技，当你死亡时，杀死你的角色失去所有武将技能。",

  jx_zuoci: "界左慈",
  jx_zuoci_prefix: "界",
  jx_huashen: "化身",
  jx_huashen_info:
    "游戏开始时，你随机获得三张未加入游戏的武将牌作为“化身”牌，然后亮出其中一张，声明获得该“化身”牌的一个技能（除限定、觉醒、主公、隐匿技外），且性别与势力视为与该“化身”牌相同。回合开始时或回合结束时，你可以选择一项：1.更换亮出的“化身”牌并重新声明获得的技能；2.移去至多两张未亮出的“化身”牌，然后随机获得等量新的“化身”牌。",
  jx_xinsheng: "新生",
  jx_xinsheng_info: "当你受到1点伤害后，你可以获得一张新的“化身”牌。",

  jx_sunce: "界孙策",
  jx_sunce_prefix: "界",
  jiang: "激昂",
  jiang_info:
    "每当你使用（指定目标后）或被使用（成为目标后）一张【决斗】或红色的【杀】时，你可以摸一张牌。",
  jx_hunzi: "魂姿",
  jx_hunzi_info: `觉醒技，准备阶段，若你的体力值不大于2，你减1点体力上限，然后获得${get.poptip("jx_yingzi")}和${get.poptip("yinghun")}。`,
  zhiba: "制霸",
  zhiba_info:
    "主公技，每名其他吴势力角色的出牌阶段限一次，该角色可以与你拼点（若你已发动过“魂姿”，则你可以拒绝此次拼点）：若其没赢，你可以获得你与其此次拼点的牌。",

  jx_zhangzhang: "界张昭张纮",
  jx_zhangzhang_prefix: "界",
  jx_zhijian: "直谏",
  jx_zhijian_info:
    "出牌阶段，你可以将手牌中的一张装备牌置于一名其他角色的装备区里，然后你摸一张牌；当你于出牌阶段内使用装备牌时，你摸一张牌。",
  guzheng: "固政",
  guzheng_info:
    "其他角色的弃牌阶段结束时，你可以将弃牌堆里该角色此阶段内弃置的一张手牌返还给其，然后你可以获得弃牌堆里所有其余于此阶段内弃置的牌。",

  jx_liushan: "界刘禅",
  jx_liushan_prefix: "界",
  xiangle: "享乐",
  xiangle_info:
    "锁定技，当你成为一名角色【杀】的目标后，除非该角色弃置一张基本牌，否则此【杀】对你无效。",
  jx_fangquan: "放权",
  jx_fangquan_info:
    "出牌阶段开始前，若你未跳过此阶段，你可以跳过出牌阶段，然后此回合你的手牌上限等于你的体力上限值，且此回合结束时，你可以弃置一张手牌，令一名其他角色执行一个额外的回合。",
  ruoyu: "若愚",
  ruoyu_info: `主公技，觉醒技，准备阶段，若你是体力值最小的角色，你加1点体力上限，回复1点体力，然后获得${get.poptip("jijiang")}。`,

  jx_zhanghe: "界张郃",
  jx_zhanghe_prefix: "界",
  jx_qiaobian: "巧变",
  jx_qiaobian_info:
    "每轮开始时，你可以与一名上轮未选择过的角色各摸一张牌；本轮其回合内：你可以弃置一张牌跳过其一个主要阶段，若为：摸牌阶段，其获得至多两名角色各一张手牌；出牌阶段，其可以移动场上一张牌。",

  wangji: "王基",
  qizhi: "奇制",
  qizhi_info:
    "当你于回合内使用基本牌或锦囊牌指定目标后，你可以弃置不是此牌目标的一名角色的一张牌。若如此做，其摸一张牌。",
  jinqu: "进趋",
  jinqu_info:
    "结束阶段，你可以摸两张牌。若如此做，你将手牌弃置至X张（X为你于此回合内发动过“奇制”的次数）。",

  yanyan: "严颜",
  juzhan: "拒战",
  juzhan_info:
    "转换技，①当你成为其他角色使用【杀】的目标后，你可以与其各摸一张牌，然后其本回合不能再对你使用牌。②当你使用【杀】指定一名角色为目标后，你可以获得其一张牌，然后你本回合不能再对其使用牌。",

  wangping: "王平",
  feijun: "飞军",
  feijun_info:
    "出牌阶段限一次，你可以弃置一张牌，然后选择一项：令一名手牌数大于你的角色交给你一张牌；或令一名装备区里牌数大于你的角色弃置一张装备牌。",
  binglve: "兵略",
  binglve_info: "锁定技，当你发动“飞军”时，若目标与你之前指定的目标均不相同，则你摸两张牌。",

  luji: "陆绩",
  huaiju: "怀橘",
  huaiju_info:
    "锁定技，游戏开始时，你获得3个“橘”标记（有“橘”的角色受到伤害时，防止此伤害，然后移去一个“橘”；有“橘”的角色摸牌阶段额外摸一张牌）。",
  tachibana_effect: "怀橘",
  yili: "遗礼",
  yili_info: "出牌阶段开始时，你可以失去1点体力或移去一个“橘”，然后令一名其他角色获得一个“橘”。",
  zhenglun: "整论",
  zhenglun_info: "若你没有“橘”，你可以跳过摸牌阶段然后获得一个“橘”。",

  sunliang: "孙亮",
  kuizhu: "溃诛",
  kuizhu_info:
    "弃牌阶段结束时，你可以选择一项：令至多X名角色各摸一张牌；对任意名体力值之和为X的角色造成1点伤害，若不少于两名角色，你须受到1点伤害（X为你此阶段弃置的牌数）。",
  zhizheng: "掣政",
  zhizheng_info:
    "锁定技，你的出牌阶段内，攻击范围内不包含你的角色不能成为你使用牌的目标。出牌阶段结束时，若你本阶段内使用的牌数小于这些角色数，你弃置其中一名角色一张牌。",
  lijun1: "立军",
  lijun: "立军",
  lijun_info:
    "主公技，其他吴势力角色于其出牌阶段使用【杀】结算结束后，其可以将此【杀】交给你，然后你可以令其摸一张牌。",

  kuaiyuekuailiang: "蒯良蒯越",
  jianxiang: "荐降",
  jianxiang_info: "当你成为其他角色使用牌的目标后，你可令手牌数最少的一名角色摸一张牌。",
  shenshi: "审时",
  shenshi_info:
    "转换技，①出牌阶段限一次，你可以将一张牌交给一名手牌数最多的角色，然后对其造成1点伤害。若该角色因此死亡，则你可以令一名角色将手牌摸至四张。②其他角色对你造成伤害后，你可以观看该角色的手牌，然后交给其一张牌，当前回合结束时，若该角色未失去此牌，你将手牌摸至四张。",

  xuyou: "许攸",
  chenglve: "成略",
  chenglve_info:
    "转换技，出牌阶段限一次，①你可以摸一张牌，然后弃置两张手牌。②你可以摸两张牌，然后弃置一张手牌。若如此做，直到本回合结束，你使用与弃置牌相同花色的牌无距离和次数限制。",
  shicai: "恃才",
  shicai_info:
    "当你使用一张牌结算结束后，若此牌与你本回合使用的牌类型均不同，你可以将此牌置于牌堆顶，然后摸一张牌。",
  cunmu: "寸目",
  cunmu_info: "锁定技，当你摸牌时，改为从牌堆底摸牌。",

  luzhi: "卢植",
  mingren: "明任",
  mingren_info:
    "游戏开始时，你摸一张牌，然后将你的一张手牌置于你的武将牌上，称为“任”。结束阶段，你可以用一张手牌替换“任”。",
  zhenliang: "贞良",
  zhenliang_info:
    "转换技，①出牌阶段限一次，你可以选择一名攻击范围内的其他角色，然后弃置X张与“任”颜色相同的牌对其造成1点伤害（X为你与其体力值之差且至少为1）。②你的回合外，当你使用或打出的牌进入弃牌堆时，若此牌与“任”类别相同，则你可令一名角色摸一张牌。",

  guanqiujian: "毌丘俭",
  zhengrong: "征荣",
  zhengrong_info:
    "当你对其他角色造成伤害后，若其手牌数大于你，你可以将其一张牌置于你的武将牌上，称为“荣”。",
  hongju: "鸿举",
  hongju_info: `觉醒技，准备阶段，若“荣”的数量大于等于3且场上有角色死亡，则你可以用任意张手牌替换等量的“荣”，然后扣减1点体力上限并获得${get.poptip("qingce")}。`,
  qingce: "清侧",
  qingce_backup: "清侧",
  qingce_info: "出牌阶段，你可以移去一张“荣”，然后弃置场上的一张牌。",

  chendao: "陈到",
  wanglie: "往烈",
  wanglie_info:
    "出牌阶段，你使用的第一张牌无距离限制。当你于出牌阶段使用一张牌时，你可令此牌不能被响应，若如此做，则本回合你不能再使用牌。",

  zhugezhan: "诸葛瞻",
  zuilun: "罪论",
  zuilun_info:
    "结束阶段，你可以观看牌堆顶三张牌，你每满足以下一项便保留一张，然后以任意顺序放回其余的牌：1.你于此回合内造成过伤害；2.你于此回合内未弃置过牌；3.手牌数为全场最少。若均不满足，你与一名其他角色失去1点体力。",
  fuyin: "父荫",
  fuyin_info:
    "锁定技，你每回合第一次成为【杀】或【决斗】的目标后，若你的手牌数小于等于使用者，此牌对你无效。",

  zhoufei: "周妃",
  liangyin: "良姻",
  liangyin_info:
    "当有牌移出游戏时，你可以令手牌数大于你的一名角色摸一张牌；当有牌从游戏外加入任意角色的手牌时，你可以令手牌数小于你的一名角色弃置一张牌。",
  kongsheng: "箜声",
  kongsheng_info:
    "准备阶段，你可以将任意张牌置于武将牌上。结束阶段，你使用武将牌上的装备牌，并获得武将牌上的其他牌。",
  kongsheng2: "箜声",
  kongsheng2_info: "",

  lukang: "陆抗",
  qianjie: "谦节",
  qianjie_info: "锁定技，你不能被横置，且不能成为延时类锦囊牌或其他角色拼点的目标。",
  jueyan: "决堰",
  jueyan_info: `出牌阶段限一次，你可以废除你装备区里的一种装备栏，然后执行对应的一项：武器栏，本回合你可以多使用三张【杀】；防具栏，摸三张牌，本回合手牌上限+3；坐骑栏，本回合你使用牌无距离限制；宝物栏，本回合获得${get.poptip("jx_jizhi")}。`,
  poshi: "破势",
  poshi_info: `觉醒技，准备阶段，若你所有装备栏均被废除或体力值为1，则你减1点体力上限，然后将手牌补至体力上限，失去“决堰”并获得${get.poptip("huairou")}。`,
  huairou: "怀柔",
  huairou_info: "出牌阶段，你可以重铸装备牌。",

  zhangxiu: "张绣",
  congjian: "从谏",
  congjian_info:
    "当你成为锦囊牌的目标时，若此牌的目标数大于1，则你可以交给其中一名目标角色一张牌，然后摸一张牌。若你给出的牌是装备牌，改为摸两张牌。",
  xiongluan: "雄乱",
  xiongluan_info:
    "限定技，出牌阶段，你可以废除你的判定区和装备区，然后指定一名其他角色，直到回合结束，你对其使用牌无距离和次数限制，其不能使用和打出手牌。",

  haozhao: "郝昭",
  zhengu: "镇骨",
  zhengu2: "镇骨",
  zhengu_info:
    "结束阶段，你可以选择一名其他角色，你的回合结束时和该角色的下个回合结束时，其将手牌摸至或弃至与你手牌数相同（最多摸至五张）。",

  yuanshu: "袁术",
  yongsi: "庸肆",
  yongsi_info:
    "锁定技，摸牌阶段，你改为摸X张牌（X为存活势力数）；出牌阶段结束时，若你此阶段：1.没有造成伤害，将手牌摸至当前体力值；2.造成伤害数超过1点，本回合手牌上限改为已损失体力值。",
  weidi: "伪帝",
  weidi_tag: "伪帝",
  weidi_info: "主公技，你于弃牌阶段弃置的牌可以交给任意名其他群势力角色各一张。",

  shen_guanyu: "神关羽",
  shen_guanyu_prefix: "神",
  wushen: "武神",
  wushen_info: "锁定技，你的♥手牌均视为【杀】；你使用♥【杀】无距离限制。",
  wuhun: "武魂",
  wuhun_info:
    "锁定技，当你受到1点伤害后，你令伤害来源获得1枚“梦魇”标记；当你死亡时，你选择一名拥有“梦魇”标记数最多的其他角色，令其进行判定，若结果不为【桃】或【桃园结义】，则该角色死亡。",

  shen_lvmeng: "神吕蒙",
  shen_lvmeng_prefix: "神",
  shelie: "涉猎",
  shelie_info: "摸牌阶段，你可以改为亮出牌堆顶的五张牌，然后你选择其中每种花色的各一张牌获得之。",
  gongxin: "攻心",
  gongxin_info:
    "出牌阶段限一次，你可以观看一名其他角色的所有手牌并可以展示其中一张♥牌，然后你选择一项：1.弃置此牌；2.将此牌置于牌堆顶。",

  shen_zhouyu: "神周瑜",
  shen_zhouyu_prefix: "神",
  qinyin: "琴音",
  qinyin_info:
    "弃牌阶段结束时，若你于此阶段内弃置过你的至少两张手牌，则你可以选择一项：1.令所有角色各回复1点体力；2.令所有角色各失去1点体力。",
  yeyan: "业炎",
  yeyan_info:
    "限定技，出牌阶段，你可以选择一项：1.选择至多三名角色，然后你对这些角色各造成1点火焰伤害；2.选择至多两名角色并弃置四张花色均不同的手牌，然后你失去3点体力，对这些角色造成共计至多3点火焰伤害且其中有角色需分配2点或更多伤害点数。",

  shen_zhugeliang: "神诸葛亮",
  shen_zhugeliang_prefix: "神",
  qixing: "七星",
  qixing_bg: "星",
  qixing_info:
    "游戏开始时，你将牌堆顶的七张牌扣置于你的武将牌上，称为“星”，然后你可以用任意张手牌替换等量的“星”；摸牌阶段结束时，你可以用任意张手牌替换等量的“星”。",
  kuangfeng: "狂风",
  kuangfeng2: "狂风",
  kuangfeng2_bg: "风",
  kuangfeng_info:
    "结束阶段，你可以移去一张“星”并选择一名角色，然后直到你的下回合开始前或你死亡前，当其受到火焰伤害时，此伤害+1。",
  dawu: "大雾",
  dawu2_bg: "雾",
  dawu2: "大雾",
  dawu_info:
    "结束阶段，你可以移去任意张“星”并选择等量的角色，然后直到你的下回合开始前或你死亡前，当这些角色受到非雷电伤害时，防止此伤害。",

  shen_caocao: "神曹操",
  shen_caocao_prefix: "神",
  guixin: "归心",
  guixin_info: "当你受到1点伤害后，你可以各获得每名其他角色所属区域里的一张牌，然后你翻面。",
  feiying: "飞影",
  feiying_info: "锁定技，其他角色与你的距离+1。",

  shen_lvbu: "神吕布",
  shen_lvbu_prefix: "神",
  kuangbao: "狂暴",
  kuangbao_bg: "暴",
  kuangbao_info:
    "锁定技，游戏开始时，你获得2枚“暴怒”标记；当你造成或受到1点伤害后，你获得1枚“暴怒”标记。",
  wumou: "无谋",
  wumou_info: "锁定技，当你使用普通锦囊牌时，你选择一项：1.弃1枚“暴怒”；2.失去1点体力。",
  wuqian: "无前",
  wuqian_info: `出牌阶段，你可以弃2枚“暴怒”并选择一名其他角色，然后令其于此回合内防具失效且此回合你获得${get.poptip("wushuang")}。`,
  shenfen: "神愤",
  shenfen_info:
    "出牌阶段限一次，你可以弃6枚“暴怒”标记，对所有其他角色各造成1点伤害，若如此做，这些角色先各弃置装备区里所有的牌，再各弃置四张手牌，然后你翻面。",

  jshen_zhaoyun: "神赵云",
  jshen_zhaoyun_prefix: "神",
  jx_juejing: "绝境",
  jx_juejing_info: "锁定技，你的手牌上限+2；当你进入濒死状态时或当你脱离濒死状态后，你摸一张牌。",
  jx_longhun: "龙魂",
  longhun1: "龙魂♥︎",
  longhun2: "龙魂♦︎",
  longhun3: "龙魂♣︎",
  longhun4: "龙魂♠︎",
  jx_longhun_info:
    "你可以将至多两张花色相同的牌按以下规则使用或打出：♥牌当【桃】；♦牌当火【杀】；♣牌当【闪】；♠牌当【无懈可击】。若你以此法使用或打出：两张♥牌，则此牌回复的体力+1；两张♦牌，则此牌造成的伤害+1；两张♣或♠牌，则你弃置当前回合角色的一张牌。",

  jshen_simayi: "神司马懿",
  jshen_simayi_prefix: "神",
  renjie: "忍戒",
  renjie2: "忍戒",
  renjie_info:
    "锁定技，当你受到伤害后或于弃牌阶段内因弃置而失去手牌后，你获得X枚“忍”标记（X为此伤害值或你此次弃置的手牌数）。",
  lianpo: "连破",
  lianpo_info:
    "每名角色的回合结束时，若你于此回合内杀死过角色，你可以于此回合结束后执行一个额外的回合。",
  sbaiyin: "拜印",
  sbaiyin_info: `觉醒技，准备阶段，若“忍”标记数量不小于4，你减1点体力上限，然后获得${get.poptip("jilue")}。`,
  jilue: "极略",
  jilue_info: `你可以于能发动技能${get.poptip("jilue_guicai")}、${get.poptip("jilue_fangzhu")}、${get.poptip("jilue_jizhi")}、${get.poptip("jilue_zhiheng")}的时机弃1枚“忍”，然后发动一次相应技能；出牌阶段，你可以弃1枚“忍”，然后你于此回合内拥有${get.poptip("jilue_wansha")}。`,
  jilue_wansha: "完杀",
  jilue_wansha_info:
    "锁定技。①你的回合内，不处于濒死状态的其他角色不能使用【桃】。②当有角色于你的回合内进入濒死状态时，你令其以外的所有其他角色的非锁定技失效直到此濒死状态结算结束。",
  jilue_zhiheng: "制衡",
  jilue_zhiheng_info:
    "出牌阶段限一次，你可以弃置任意张牌并摸等量的牌，若你在发动〖制衡〗时弃置了所有手牌，则你多摸一张牌。",
  jilue_guicai: "鬼才",
  jilue_guicai_info: "在任意角色的判定牌生效前，你可以打出一张牌代替之。",
  jilue_fangzhu: "放逐",
  jilue_fangzhu_info:
    "当你受到伤害后，你可以令一名其他角色翻面，然后其摸X张牌（X为你已损失的体力值）。",
  jilue_jizhi: "集智",
  jilue_jizhi_info:
    "当你使用锦囊牌时，你可以摸一张牌。若此牌为基本牌，则你可以弃置之，然后令本回合手牌上限+1。",

  le_liubei: "神刘备",
  le_liubei_prefix: "神",
  longnu: "龙怒",
  longnu_info:
    "转换技，锁定技，出牌阶段开始时，①你失去1点体力，然后你摸一张牌且于此阶段内：你的红色手牌均视为火【杀】、你使用火【杀】无距离限制；②你减1点体力上限，然后你摸一张牌且于此阶段内：你的锦囊牌均视为雷【杀】、你使用雷【杀】无次数限制。",
  jieying: "结营",
  jieying_info:
    "锁定技，游戏开始时，你横置你的武将牌；当你的武将牌重置前，你防止此次重置，所有处于连环状态的角色手牌上限+2；结束阶段，你横置一名未处于连环状态的其他角色。",

  le_luxun: "神陆逊",
  le_luxun_prefix: "神",
  junlve: "军略",
  junlve_info: "锁定技，当你造成或受到1点伤害后，你获得1枚“军略”标记。",
  cuike: "摧克",
  cuike_info:
    "出牌阶段开始时，若你的“军略”数为：奇数，你可以对一名角色造成1点伤害；偶数，你可以选择一名未处于连环状态或区域里有牌的角色，你弃置其所属区域里的一张牌，横置其武将牌。若你的“军略”数大于7，你可以移去你所有的“军略”，然后对所有其他角色各造成1点伤害。",
  zhanhuo: "绽火",
  zhanhuo_info:
    "限定技，出牌阶段，你可以移去你所有“军略”并选择至多等量的处于连环状态的角色，然后先令这些角色各弃置其装备区里所有的牌，再选择其中一名角色并对其造成1点火焰伤害。",

  le_zhangliao: "神张辽",
  le_zhangliao_prefix: "神",
  duorui1: "失效技能",
  duorui1_bg: "锐",
  duorui: "夺锐",
  duorui_info:
    "当你于出牌阶段内对一名其他角色造成伤害后，你可以废除你的一个装备栏，然后你选择其武将牌上的一个技能（除限定、觉醒、主公、隐匿技外），令其此技能于其下个回合结束之前无效，你于其下个回合结束或其死亡前拥有此技能且不能发动“夺锐”。",
  zhiti: "止啼",
  zhiti_info:
    "锁定技，你攻击范围内已受伤的其他角色的手牌上限-1；当符合下列任意一项时机条件，若你有已废除的装备栏，你选择其中一个装备栏恢复：1.当你因【决斗】效果对你攻击范围内已受伤的其他角色造成伤害时；2.当你与你攻击范围内已受伤的其他角色的拼点结果确定后，若结果为你赢；3.当你受到你攻击范围内已受伤的其他角色对你造成伤害后。",

  le_ganning: "神甘宁",
  le_ganning_prefix: "神",
  poxi: "魄袭",
  poxi_info:
    "出牌阶段限一次，你可以观看一名其他角色的所有手牌，然后你可以弃置你与其手牌中共计四张花色均不同的牌。若你此次弃置你的牌数为：没有，你减1点体力上限；一张，你结束此阶段且你的手牌上限于此回合-1；三张，你回复1点体力；四张，你摸四张牌。",
  ljieying: "劫营",
  ljieying_info:
    "回合开始后，若没有角色有“营”标记，你获得“营”标记；结束阶段，你可以将你的“营”交给一名没有“营”的其他角色；有“营”的角色的摸牌阶段，你令该角色多摸一张牌；有“营”的角色的出牌阶段可以多使用一张【杀】。有“营”的角色手牌上限+1；有“营”的其他角色的回合结束后，其移去“营”，然后你获得其所有手牌。",
}

export default translates
