const characterIntro = {
  yuejin:
    "乐进（？－218年），字文谦，阳平郡卫国（今河南清丰）人。以胆识英烈而从曹操，南征北讨。从击袁绍于官渡，奋勇力战，斩袁绍部将淳于琼。曹操自合肥还，留下乐进与张辽、李典屯于合肥。后来，以乐进数有军功，迁右将军。建安二十三年（218年）逝世，谥曰威侯。",
  lidian:
    "李典（生卒年不详），字曼成。山阳郡钜野县（今山东巨野）人。<br><br>李典年少时好学，不爱好征战，于是拜师读《春秋左氏传》，熟读各种书籍。建安十九年（214年）十月，曹操自合肥还，李典与张辽、乐进在合肥驻扎。建安二十年（215年）八月，孙权指挥十万大军围攻合肥，张辽打算按照教谕与李典一同出城交战。乐进、李典、张辽平常都互不和睦。张辽担心李典不从，李典慷慨的说：“这是国家大事，要看你的计策是否好，（如果可行）我怎么能够因为私怨而不顾大局呢！”于是，率领部众与张辽一起打败赶走了孙权。<br><br>李典爱好学问，注重儒雅，从来不和别的将领争抢功劳。尊敬贤士大夫，恐怕有礼节不周的地方，军营的官兵都认为他是长者。三十六岁时去世。",
  caoang:
    "曹昂（？－197年），字子脩，沛国谯县（今安徽亳州）人。曹操的长子，刘氏所生，但生母早亡是以由正室丁氏抚养大。二十岁时被举为孝廉。建安二年（197年）随曹操出征张绣，张绣降而复叛，曹昂为救曹操被杀。魏文帝黄初二年（221年），追封谥号丰悼公，黄初五年（224年）又进一步追封为丰悼王。太和三年（229年）年改谥号丰愍王。",
  simalang:
    "司马朗（171年~217年），字伯达，河内郡温县人，东汉末年政治家，“司马八达”之一。司马朗年少时就表现得很有见识，汉末动乱之际，受父命带领家属逃离董卓，又迁往黎阳，成功躲避战乱。曹操任司空后，司马朗被辟为司空属官，又历任成皋令、堂阳长、元城令、丞相主簿、兖州刺史等职，所在皆有政绩，深受百姓爱戴。后司马朗与夏侯惇、臧霸等征讨吴国，到达居巢。军队中流行瘟疫，司马朗亲自去视察，派送医药，因此染病，最终去世，时年四十七岁。他去世之后，兖州的人民都相当怀念他。",
  guanyinping:
    "关银屏（202—？），河东郡解县（今山西省运城市）人，三国时期名将关羽之女在民间传说中的名字，该名不见史书记载，仅在民间传说中出现，因在关羽的四个子女中排行第三，故又被称作“关三小姐”、“关氏三姐”或“关家三小姐”。在传说中她是黄月英的弟子、并随同诸葛亮平定南蛮，嫁给蜀国名臣李恢之子李遗。",
  dongyun:
    "董允，字休昭，南郡枝江（今湖北枝江）人，三国时期蜀汉重臣，掌军中郎将董和之子。东汉末年，其父董和事刘璋为益州太守，刘备立太子时，允被选为洗马，后为黄门侍郎（即《出师表》“侍中、侍郎郭攸之、费祎、董允等，此皆良实”这句话里的侍郎），延熙六年（公元243年）加辅国将军，延熙七年（公元244年）以侍中守尚书令，任大将军费祎的副手。",
  sunqian:
    "孙乾（？~约215），字公祐。北海郡（治今山东昌乐西）人。东汉末年刘备的幕僚。最初被大儒郑玄推荐于州里。刘备领徐州，以孙乾为从事。自徐州跟随刘备，多次作为刘备的使臣。刘备定益州后，拜孙乾为秉忠将军，其待遇仅次于麋竺，与简雍相同。不久便病逝。",

  wolongfengchu:
    "诸葛亮（181年—234年10月8日），字孔明，号卧龙，琅琊阳都（今山东省沂南县）人，三国时期蜀汉丞相，中国历史上杰出的政治家、军事家、文学家、书法家、发明家。<br><br>早年随叔父诸葛玄到荆州，诸葛玄死后，诸葛亮就在隆中隐居。后刘备三顾茅庐请出诸葛亮，联合东吴孙权于赤壁之战大败曹军。形成三国鼎足之势，又夺占荆州。建安十六年（211年），攻取益州。继又击败曹军，夺得汉中。蜀章武元年（221年），刘备在成都建立蜀汉政权，诸葛亮被任命为丞相，主持朝政。后主刘禅继位，诸葛亮被封为武乡侯，领益州牧。勤勉谨慎，大小政事必亲自处理，赏罚严明；与东吴联盟，改善和西南各族的关系；实行屯田政策，加强战备。前后五次北伐中原，多以粮尽无功。终因积劳成疾，于蜀建兴十二年（234年）病逝于五丈原，享年54岁。刘禅追封其为忠武侯，后世常以武侯尊称诸葛亮。东晋政权因其军事才能特追封他为武兴王。<br><br>诸葛亮散文代表作有《出师表》《诫子书》等。曾发明木牛流马、孔明灯等，并改造连弩，叫做诸葛连弩，可一弩十矢俱发。诸葛亮一生“鞠躬尽瘁、死而后已”，是中国传统文化中忠臣与智者的代表人物。<br><br>诸葛亮在三国杀中是现存版本最多的武将。蜀中无大将，尽是诸葛亮。<br><br>庞统（179年－214年），字士元，号凤雏，汉时荆州襄阳（治今湖北襄阳）人。东汉末年刘备帐下重要谋士，与诸葛亮同拜为军师中郎将。<br><br>庞统初任郡功曹，后跟随周瑜，被周瑜任以大事，周瑜逝世于巴丘，庞统为其吊丧至东吴，与陆绩、顾劭、全琮等人结交而还。南郡借给刘备后，从事署理，继守耒阳令，不治理公务而被免职。鲁肃、诸葛亮以庞统“非百里之才”力荐，刘备十分器重，委以治中从事重任。后与刘备一同入川，于刘备与刘璋决裂之际，献上上中下三条计策，刘备用其中计。进围雒县时，庞统率众攻城，不幸中流矢而亡，年仅三十六岁，追赐统为关内侯，谥曰靖侯。葬于落凤坡。",
}

export default characterIntro
