const characterIntro = {
  wolongfengchu:
    "诸葛亮（181年—234年10月8日），字孔明，号卧龙，琅琊阳都（今山东省沂南县）人，三国时期蜀汉丞相，中国历史上杰出的政治家、军事家、文学家、书法家、发明家。<br><br>早年随叔父诸葛玄到荆州，诸葛玄死后，诸葛亮就在隆中隐居。后刘备三顾茅庐请出诸葛亮，联合东吴孙权于赤壁之战大败曹军。形成三国鼎足之势，又夺占荆州。建安十六年（211年），攻取益州。继又击败曹军，夺得汉中。蜀章武元年（221年），刘备在成都建立蜀汉政权，诸葛亮被任命为丞相，主持朝政。后主刘禅继位，诸葛亮被封为武乡侯，领益州牧。勤勉谨慎，大小政事必亲自处理，赏罚严明；与东吴联盟，改善和西南各族的关系；实行屯田政策，加强战备。前后五次北伐中原，多以粮尽无功。终因积劳成疾，于蜀建兴十二年（234年）病逝于五丈原，享年54岁。刘禅追封其为忠武侯，后世常以武侯尊称诸葛亮。东晋政权因其军事才能特追封他为武兴王。<br><br>诸葛亮散文代表作有《出师表》《诫子书》等。曾发明木牛流马、孔明灯等，并改造连弩，叫做诸葛连弩，可一弩十矢俱发。诸葛亮一生“鞠躬尽瘁、死而后已”，是中国传统文化中忠臣与智者的代表人物。<br><br>诸葛亮在三国杀中是现存版本最多的武将。蜀中无大将，尽是诸葛亮。<br><br>庞统（179年－214年），字士元，号凤雏，汉时荆州襄阳（治今湖北襄阳）人。东汉末年刘备帐下重要谋士，与诸葛亮同拜为军师中郎将。<br><br>庞统初任郡功曹，后跟随周瑜，被周瑜任以大事，周瑜逝世于巴丘，庞统为其吊丧至东吴，与陆绩、顾劭、全琮等人结交而还。南郡借给刘备后，从事署理，继守耒阳令，不治理公务而被免职。鲁肃、诸葛亮以庞统“非百里之才”力荐，刘备十分器重，委以治中从事重任。后与刘备一同入川，于刘备与刘璋决裂之际，献上上中下三条计策，刘备用其中计。进围雒县时，庞统率众攻城，不幸中流矢而亡，年仅三十六岁，追赐统为关内侯，谥曰靖侯。葬于落凤坡。",
}

export default characterIntro
