const characterIntro = {
  caozhi:
    "曹植（192年－232年12月27日），字子建，沛国谯县（今安徽亳州）人，是曹操与武宣卞皇后所生第三子，生前曾为陈王，去世后谥号“思”，因此又称陈思王。<br><br>曹植以文采斐然闻名于世，颇受曹操喜爱。曹操曾动过改立曹植为嗣子的念头，因贾诩等人劝谏，加上曹植个性放纵、酗酒，不是经世之才而作罢。在曹丕、曹叡时期屡遭贬徙，最终郁郁而死。<br><br>曹植在两晋南北朝时期，被推尊到文章典范的地位，东晋名士谢灵运评价“天下才有一车，曹子建独占八斗”。其诗以笔力雄健和词采华美见长，留有集三十卷，已佚，今存《曹子建集》为宋人所编。<br><br>在《三国杀》中，曹植是一将成名系列的第一位武将。",
  yujin:
    "于禁（？－221年），字文则，泰山钜平（今山东泰安）人。三国时期曹魏名将。<br><br>于禁原为鲍信部将，鲍信战死后被王朗不是这个王朗引荐给曹操，之后便随曹操南征北战，立下了许多战功。因为敢于攻击不守军纪的青州兵，且为了维护军法不惜杀掉自己的故友，被曹操称赞胜过古代名将。关羽围攻襄、樊时，于禁督七军前往救援，被关羽利用秋季大雨打得全军覆没，投降后被监押在南郡。而后关羽被吕蒙击败，于禁流落至东吴，孙权向魏国称藩后，将于禁送还魏国。虽然魏文帝曹丕表面安慰于禁，却暗里让人作壁画羞辱于禁，于禁因此惭恚而死，被恶谥为厉侯。<br><br>于禁带军严肃庄重，战斗中所缴获的财物从不私藏，因此深得曹操器重，是曹操麾下外姓将领中唯一一个假节钺的人。但同时于禁常以军法处理下属，不得士卒欢心。后世将于禁称为曹魏“五子良将”之一。",
  zhangchunhua:
    "宣穆皇后张春华（189年－247年），河内郡平皋县（今河南温县）人，曹魏粟邑令张汪之女，晋宣帝司马懿之妻，晋景帝司马师和晋文帝司马昭的母亲。<br><br>正始八年（247年），张春华去世，时年五十九岁，葬于洛阳高原陵，追赠广平县君。咸熙元年（264年），追谥为宣穆妃。泰始元年（265年），张春华之孙晋武帝司马炎登基，追谥她为宣穆皇后。",
  fazheng:
    "法正（176年－220年），字孝直。扶风郿（今陕西省眉县小法仪镇）人。东汉末年刘备帐下谋士，名士法真之孙。<br><br>原为刘璋部下，刘备围成都时劝说刘璋投降，而后又与刘备进取汉中，献计将曹操大将夏侯渊斩首。法正善奇谋，深受刘备信任和敬重。<br><br>建安二十四年（219年），刘备进位汉中王，封法正为尚书令、护军将军。次年，法正去世，终年四十五岁。法正之死令刘备十分感伤，连哭数日。被追谥为翼侯，是刘备时代唯一一位有谥号的大臣。但其实是因为死的早<br><br>法正善于奇谋，被陈寿称赞为可比曹操帐下的程昱和郭嘉。《全三国文》辑录有其文一篇。",
  masu: "马谡（190年―228年），字幼常，襄阳宜城（今湖北省宜城市）人，为侍中马良之弟，三国时期蜀汉官员、将领。<br><br>马谡最初以荆州从事的身份跟随刘备进入蜀地，先后任绵竹县令、成都县令和越嶲太守。马谡才气过人，喜好议论军事谋略，丞相诸葛亮对他深为器重，二人情同父子，但刘备临终前则告诫诸葛亮“马谡言过其实，不可大用”。建兴三年（225年），诸葛亮征南中，马谡提出的“心战为上，兵战为下”之策略为诸葛亮采纳，而南中终诸葛亮一世也不曾再度反叛。建兴六年（228年），诸葛亮兵出祁山伐魏，马谡献散谣之计以离间司马懿和曹叡，诸葛亮力排众议任命马谡为蜀军前锋，统领各军前行。马谡在街亭与魏将张郃交战，因马谡不听部将王平劝阻、不遵守诸葛亮的计划，而是屯兵险处，被张郃围困后击败，军队溃散，仅有王平所部顺利撤退，街亭也被魏军占领。诸葛亮知道街亭丢失后，只能率军退守汉中。马谡被捕，死于狱中[1]（一说被诸葛亮按照军法处死[2]；亦有说法马谡逃亡，向朗知情不报被免职[3]），年仅三十九岁。",
  xushu:
    "徐庶，字元直。颍川郡长社县（今河南许昌长葛东）人。东汉末年刘备帐下谋士，后归曹操，病逝于曹魏。<br><br>徐庶本名徐福不是这个徐福，为寒门子弟。早年为人报仇，获救后改名徐庶，拜师求道。后与同郡石韬（字广元，与徐庶同期的一名谋士，与徐庶交好）避难于荆州，与司马徽、诸葛亮、崔州平等道友来往密切。刘备屯驻新野时，徐庶前往投奔，并向刘备推荐诸葛亮。徐庶南下时因母亲被曹操所掳获，徐庶不得已辞别刘备，进入曹营。后来此事被艺术加工为“徐庶进曹营，一言不发”等歇后语，被广为流传。而徐庶也成为孝子的典范被加以称赞。魏文帝时，徐庶官至右中郎将、御史中丞。在诸葛亮北伐行军至陇右（今陕甘边界六盘山西部地区）之时听见徐庶与石韬在曹魏不被重用的消息时曾感叹道：“魏殊多士邪！何彼二人不见用乎？（魏国谋士这么多吗？为什么不重用徐庶石韬二人呢？）”",
  lingtong:
    "凌统（189年－217年），字公绩，吴郡馀杭（今浙江杭州市余杭区）人，凌操之子。少有盛名，为别部司马，行破贼校尉。建安十三年（208年），孙权再次攻打江夏，凌统部队为先锋，斩敌将张硕，破其水军，吴军最终得以斩黄祖，大胜而还。被孙权任为承烈都尉。之后，随周瑜在乌林大败曹操，攻打曹仁所在的江陵，使曹仁退走。<br><br>先前凌统之杀父仇人甘宁投奔孙权。凌统怨恨甘宁，甘宁也防备凌统，尽量避免和他见面。孙权命令凌统，不得与甘宁为仇。曾经两人在吕蒙住处宴会，酒酣，凌统以刀起舞，甘宁说：“我能以双戟为舞。”吕蒙说：“你虽然可以，不如我的舞巧妙。”于是操刀持盾分开他们。孙权知道凌统的意思，于是让甘宁领兵屯于半州。<br><br>建安二十年（215年），随军攻破皖城，升为荡寇中郞将，任沛国丞相。又随吕蒙夺取长沙、零陵、桂阳三郡，夺取三郡后回师，从益阳直往合肥，时为右部督。当时，孙权决定从合肥撤军，前部兵已然出发，魏军将领张辽等忽然冲到逍遥津北边，孙权让前头兵转回来，但是部队已走远了，一时开不回来，以致凌统和亲兵三百人被魏军包围，好容易才救孙权出了围。孙权、甘宁蹴马趋津，逃至逍遥津边，但是敌人破坏了桥梁，只剩下两条长板。幸而谷利著鞭助势，使得孙权快马跳过桥。凌统则转回迎战，左右的人全都阵亡，凌统也受了伤，还奋力杀死几十个敌兵，一直到估量着孙权脱了险，凌统才肯退下来，而桥断路绝，他就穿着铠甲潜入水中进行潜泳。在撤军途中，孙权已经到了船上，忽然见到凌统活着回来，既大惊又大喜。<br><br>建安二十二年（217年）病逝，年仅二十七岁。",
  wuguotai:
    "吴国太，小说《三国演义》中的人物，不见于正史记载。在小说中，吴国太被描述为孙坚的次妻，孙坚正妻武烈皇后（小说中写作吴太夫人）的妹妹，孙朗、孙尚香的母亲，原型是孙坚之妾丁氏。<br><br>注：吴国太和正史中的吴夫人（武烈皇后）是两个人，其称号“武烈皇后”完全属于误用，切勿混为一谈！",
  xusheng:
    "徐盛（生卒年不详），字文向，琅邪莒县（今山东省莒县）人。黄祖的儿子黄射曾经率领数千人南下柴桑，攻击徐盛。徐盛以不到二百人的兵力抵抗，杀伤黄射的部队千余人。其后开门主动出战，大败黄射，黄射被击退后再也不敢前来侵犯。因功升为中郎将。在濡须浴血奋战。刘备伐吴时，徐盛跟随陆逊攻下蜀军多处屯营；曹休伐吴时，徐盛在形势不利的情况下以少抗多，成功防御。因前后战功，徐盛先后升任建武将军、安东将军，任庐江太守。后来，曹丕大举攻吴，吴国依徐盛的建议在建业外围筑上围墙，曹丕中疑城之计而退走。黄武年间，徐盛病逝。",
  chengong:
    "陈宫（？－199年2月7日），字公台，东汉末年吕布帐下首席谋士，东郡东武阳（今山东莘县）人。性情刚直，足智多谋，年少时与海内知名之士相互结交。192年，兖州刺史刘岱在讨伐青州黄巾时战死，陈宫等人主张曹操接任兖州牧因而被曹操视为心腹。但此后陈宫因曹操杀害边让等汉末名士而与曹操反目，并游说张邈背叛曹操迎吕布入兖州，辅助吕布攻打曹操并先后取得兖州与徐州。下邳城中，吕布不听陈宫两面互补之计，以致失败。吕布战败后，随吕布等一同被曹操所擒，决意赴死。",
  gaoshun:
    "吕布帐下中郎将。史载高顺为人清白有威严，不好饮酒，所统率的部队精锐非常，号称“陷阵营”。屡进忠言于吕布，吕布虽知其忠而不能用。曹操击破吕布后，高顺被曹操所杀。",
}

export default characterIntro
