const characterIntro = {
  caozhi:
    "曹植（192年－232年12月27日），字子建，沛国谯县（今安徽亳州）人，是曹操与武宣卞皇后所生第三子，生前曾为陈王，去世后谥号“思”，因此又称陈思王。<br><br>曹植以文采斐然闻名于世，颇受曹操喜爱。曹操曾动过改立曹植为嗣子的念头，因贾诩等人劝谏，加上曹植个性放纵、酗酒，不是经世之才而作罢。在曹丕、曹叡时期屡遭贬徙，最终郁郁而死。<br><br>曹植在两晋南北朝时期，被推尊到文章典范的地位，东晋名士谢灵运评价“天下才有一车，曹子建独占八斗”。其诗以笔力雄健和词采华美见长，留有集三十卷，已佚，今存《曹子建集》为宋人所编。<br><br>在《三国杀》中，曹植是一将成名系列的第一位武将。",
  yujin:
    "于禁（？－221年），字文则，泰山钜平（今山东泰安）人。三国时期曹魏名将。<br><br>于禁原为鲍信部将，鲍信战死后被王朗不是这个王朗引荐给曹操，之后便随曹操南征北战，立下了许多战功。因为敢于攻击不守军纪的青州兵，且为了维护军法不惜杀掉自己的故友，被曹操称赞胜过古代名将。关羽围攻襄、樊时，于禁督七军前往救援，被关羽利用秋季大雨打得全军覆没，投降后被监押在南郡。而后关羽被吕蒙击败，于禁流落至东吴，孙权向魏国称藩后，将于禁送还魏国。虽然魏文帝曹丕表面安慰于禁，却暗里让人作壁画羞辱于禁，于禁因此惭恚而死，被恶谥为厉侯。<br><br>于禁带军严肃庄重，战斗中所缴获的财物从不私藏，因此深得曹操器重，是曹操麾下外姓将领中唯一一个假节钺的人。但同时于禁常以军法处理下属，不得士卒欢心。后世将于禁称为曹魏“五子良将”之一。",
  zhangchunhua:
    "宣穆皇后张春华（189年－247年），河内郡平皋县（今河南温县）人，曹魏粟邑令张汪之女，晋宣帝司马懿之妻，晋景帝司马师和晋文帝司马昭的母亲。<br><br>正始八年（247年），张春华去世，时年五十九岁，葬于洛阳高原陵，追赠广平县君。咸熙元年（264年），追谥为宣穆妃。泰始元年（265年），张春华之孙晋武帝司马炎登基，追谥她为宣穆皇后。",
  fazheng:
    "法正（176年－220年），字孝直。扶风郿（今陕西省眉县小法仪镇）人。东汉末年刘备帐下谋士，名士法真之孙。<br><br>原为刘璋部下，刘备围成都时劝说刘璋投降，而后又与刘备进取汉中，献计将曹操大将夏侯渊斩首。法正善奇谋，深受刘备信任和敬重。<br><br>建安二十四年（219年），刘备进位汉中王，封法正为尚书令、护军将军。次年，法正去世，终年四十五岁。法正之死令刘备十分感伤，连哭数日。被追谥为翼侯，是刘备时代唯一一位有谥号的大臣。但其实是因为死的早<br><br>法正善于奇谋，被陈寿称赞为可比曹操帐下的程昱和郭嘉。《全三国文》辑录有其文一篇。",
  masu: "马谡（190年―228年），字幼常，襄阳宜城（今湖北省宜城市）人，为侍中马良之弟，三国时期蜀汉官员、将领。<br><br>马谡最初以荆州从事的身份跟随刘备进入蜀地，先后任绵竹县令、成都县令和越嶲太守。马谡才气过人，喜好议论军事谋略，丞相诸葛亮对他深为器重，二人情同父子，但刘备临终前则告诫诸葛亮“马谡言过其实，不可大用”。建兴三年（225年），诸葛亮征南中，马谡提出的“心战为上，兵战为下”之策略为诸葛亮采纳，而南中终诸葛亮一世也不曾再度反叛。建兴六年（228年），诸葛亮兵出祁山伐魏，马谡献散谣之计以离间司马懿和曹叡，诸葛亮力排众议任命马谡为蜀军前锋，统领各军前行。马谡在街亭与魏将张郃交战，因马谡不听部将王平劝阻、不遵守诸葛亮的计划，而是屯兵险处，被张郃围困后击败，军队溃散，仅有王平所部顺利撤退，街亭也被魏军占领。诸葛亮知道街亭丢失后，只能率军退守汉中。马谡被捕，死于狱中[1]（一说被诸葛亮按照军法处死[2]；亦有说法马谡逃亡，向朗知情不报被免职[3]），年仅三十九岁。",
  xushu:
    "徐庶，字元直。颍川郡长社县（今河南许昌长葛东）人。东汉末年刘备帐下谋士，后归曹操，病逝于曹魏。<br><br>徐庶本名徐福不是这个徐福，为寒门子弟。早年为人报仇，获救后改名徐庶，拜师求道。后与同郡石韬（字广元，与徐庶同期的一名谋士，与徐庶交好）避难于荆州，与司马徽、诸葛亮、崔州平等道友来往密切。刘备屯驻新野时，徐庶前往投奔，并向刘备推荐诸葛亮。徐庶南下时因母亲被曹操所掳获，徐庶不得已辞别刘备，进入曹营。后来此事被艺术加工为“徐庶进曹营，一言不发”等歇后语，被广为流传。而徐庶也成为孝子的典范被加以称赞。魏文帝时，徐庶官至右中郎将、御史中丞。在诸葛亮北伐行军至陇右（今陕甘边界六盘山西部地区）之时听见徐庶与石韬在曹魏不被重用的消息时曾感叹道：“魏殊多士邪！何彼二人不见用乎？（魏国谋士这么多吗？为什么不重用徐庶石韬二人呢？）”",
  lingtong:
    "凌统（189年－217年），字公绩，吴郡馀杭（今浙江杭州市余杭区）人，凌操之子。少有盛名，为别部司马，行破贼校尉。建安十三年（208年），孙权再次攻打江夏，凌统部队为先锋，斩敌将张硕，破其水军，吴军最终得以斩黄祖，大胜而还。被孙权任为承烈都尉。之后，随周瑜在乌林大败曹操，攻打曹仁所在的江陵，使曹仁退走。<br><br>先前凌统之杀父仇人甘宁投奔孙权。凌统怨恨甘宁，甘宁也防备凌统，尽量避免和他见面。孙权命令凌统，不得与甘宁为仇。曾经两人在吕蒙住处宴会，酒酣，凌统以刀起舞，甘宁说：“我能以双戟为舞。”吕蒙说：“你虽然可以，不如我的舞巧妙。”于是操刀持盾分开他们。孙权知道凌统的意思，于是让甘宁领兵屯于半州。<br><br>建安二十年（215年），随军攻破皖城，升为荡寇中郞将，任沛国丞相。又随吕蒙夺取长沙、零陵、桂阳三郡，夺取三郡后回师，从益阳直往合肥，时为右部督。当时，孙权决定从合肥撤军，前部兵已然出发，魏军将领张辽等忽然冲到逍遥津北边，孙权让前头兵转回来，但是部队已走远了，一时开不回来，以致凌统和亲兵三百人被魏军包围，好容易才救孙权出了围。孙权、甘宁蹴马趋津，逃至逍遥津边，但是敌人破坏了桥梁，只剩下两条长板。幸而谷利著鞭助势，使得孙权快马跳过桥。凌统则转回迎战，左右的人全都阵亡，凌统也受了伤，还奋力杀死几十个敌兵，一直到估量着孙权脱了险，凌统才肯退下来，而桥断路绝，他就穿着铠甲潜入水中进行潜泳。在撤军途中，孙权已经到了船上，忽然见到凌统活着回来，既大惊又大喜。<br><br>建安二十二年（217年）病逝，年仅二十七岁。",
  wuguotai:
    "吴国太，小说《三国演义》中的人物，不见于正史记载。在小说中，吴国太被描述为孙坚的次妻，孙坚正妻武烈皇后（小说中写作吴太夫人）的妹妹，孙朗、孙尚香的母亲，原型是孙坚之妾丁氏。<br><br>注：吴国太和正史中的吴夫人（武烈皇后）是两个人，其称号“武烈皇后”完全属于误用，切勿混为一谈！",
  xusheng:
    "徐盛（生卒年不详），字文向，琅邪莒县（今山东省莒县）人。黄祖的儿子黄射曾经率领数千人南下柴桑，攻击徐盛。徐盛以不到二百人的兵力抵抗，杀伤黄射的部队千余人。其后开门主动出战，大败黄射，黄射被击退后再也不敢前来侵犯。因功升为中郎将。在濡须浴血奋战。刘备伐吴时，徐盛跟随陆逊攻下蜀军多处屯营；曹休伐吴时，徐盛在形势不利的情况下以少抗多，成功防御。因前后战功，徐盛先后升任建武将军、安东将军，任庐江太守。后来，曹丕大举攻吴，吴国依徐盛的建议在建业外围筑上围墙，曹丕中疑城之计而退走。黄武年间，徐盛病逝。",
  chengong:
    "陈宫（？－199年2月7日），字公台，东汉末年吕布帐下首席谋士，东郡东武阳（今山东莘县）人。性情刚直，足智多谋，年少时与海内知名之士相互结交。192年，兖州刺史刘岱在讨伐青州黄巾时战死，陈宫等人主张曹操接任兖州牧因而被曹操视为心腹。但此后陈宫因曹操杀害边让等汉末名士而与曹操反目，并游说张邈背叛曹操迎吕布入兖州，辅助吕布攻打曹操并先后取得兖州与徐州。下邳城中，吕布不听陈宫两面互补之计，以致失败。吕布战败后，随吕布等一同被曹操所擒，决意赴死。",
  gaoshun:
    "吕布帐下中郎将。史载高顺为人清白有威严，不好饮酒，所统率的部队精锐非常，号称“陷阵营”。屡进忠言于吕布，吕布虽知其忠而不能用。曹操击破吕布后，高顺被曹操所杀。",

  zhonghui:
    "钟会（225年－264年3月3日），字士季，颍川长社（今河南长葛）人。三国时期魏国军事家、书法家，太傅钟繇幼子、青州刺史钟毓之弟。随从司马师征讨毌丘俭，典知机密。献策于司马昭，粉碎曹髦的复权企图。随军平定诸葛诞叛乱，屡出奇谋，时人比之为张良。景元年间，力挺司马昭伐蜀计划，拜镇西将军、假节、都督关中诸军事，主持伐蜀事宜。景元四年（263年），魏灭蜀之战中，配合邓艾分兵进取，最终灭亡蜀汉。拜司徒，封县侯。功成之后，萌生不臣之心，勾结蜀将姜维，图谋据蜀自立，打压太尉邓艾。景元五年（264年）正月，以郭太后遗命之名，矫诏讨伐司马昭，为部将胡烈所害，死于乱军，时年四十岁。",
  wangyi:
    "王异（或作士异），东汉末年曹操设置的羌道令、益州刺史赵昂之妻，赵英、赵月之母。<br><br>马超作乱凉州时，王异协助丈夫守城，多有功勋，自马超攻冀城至祁山坚守，赵昂曾出奇计九条，王异皆有参与。",
  xunyou:
    "荀攸，字公达，颍川颍阴（今河南许昌）人。荀彧之侄，东汉末年谋士。<br><br>荀攸在何进掌权时期任黄门侍郎，在董卓进京时曾因密谋刺杀董卓而入狱，后弃官回家。 曹操迎天子入许都之后，荀攸成为曹操的军师。 曹操征伐吕布时荀攸劝阻了曹操退兵，并献奇计水淹下邳城，活捉吕布。<br><br>在官渡之战中，计斩颜良文丑，又策奇兵派徐晃烧袁绍粮草，又力劝曹操采纳许攸之计奔袭乌巢，又力劝曹洪接纳张郃、高览，皆立下大功。<br><br>建安八年（203年），刘表强盛。荀攸力排众议，主张趁袁绍诸子不和而先攻河北，被曹操上奏朝廷封为陵树亭侯。荀攸行事周密低调，计谋百出，深受曹操称赞。建安十九年（214年），荀攸在曹操伐吴途中去世。谥曰敬侯。<br><br>荀攸被称为曹操的“谋主”，擅长灵活多变的克敌战术和军事策略。他生前设奇策共十二计，只有钟繇知道。钟繇整理未全就去世了，故后世不得而知。",
  guanzhang:
    "关兴，字安国，生卒年不详，河东解县（今山西运城）人，汉末名将关羽次子，关平之弟。关兴从小就有好名声，丞相诸葛亮十分器重他，成年后，在蜀汉担任侍中、中监军之职，继承父亲汉寿亭侯的爵位几年后病亡。有子关统、关彝。《三国志 蜀书 关张马黄赵传第六》记载“（关羽）子兴嗣。兴字安国，少有令问，丞相诸葛亮深器异之。弱冠为侍中、中监军，数岁卒。子统嗣，尚公主，官至虎贲中郎将。卒，无子，以兴庶子彝续封。”<br><br>张苞（201年－231年），三国时期蜀汉武将、官员，蜀汉名将张飞的长子，早夭。《三国志 蜀书 关张马黄赵传第六》记载“（张飞）长子苞，早夭。次子绍嗣，官至侍中尚书仆射。苞子遵为尚书，随诸葛瞻于绵竹，与邓艾战，死。”<br><br>《三国演义》中俩人也学父辈义结金兰，并称“小关张”。",
  liaohua:
    "廖化（？－264年），本名淳，字元俭，荆州襄阳郡中卢县（今湖北省襄阳市）人。三国时蜀汉将领。<br><br>关羽败亡后，归属孙吴，用诈死之计回归蜀汉，被刘备授为宜都太守。刘备去世后，转拜丞相参军，后为广武都督，迁阴平太守，多次参与蜀汉的北伐。官至右车骑将军，假节，领并州刺史，封中乡侯。蜀汉灭亡后，被迁往洛阳，于中途病逝。",
  madai:
    "马岱，表字不详，生卒年不详，扶风茂陵（今陕西省兴平市）人。马超的从弟，蜀汉将领。早年追随马超大战曹操，反攻陇上，围攻成都，汉中之战等。后在诸葛亮病逝后受杨仪派遣斩杀了蜀将魏延。曾率领军队出师北伐，被魏将牛金击败而退还。官至平北将军，陈仓侯。",
  bulianshi:
    "步练师（？－238年），临淮淮阴（今江苏省淮安市）人，吴大帝孙权的宠妃。丞相步骘族人。步练师生有二女全公主和朱公主。孙权即帝位，拜为夫人。宫中以皇后礼节待之。赤乌元年（238年），步练师去世，追封皇后，葬于蒋陵。",
  chengpu:
    "程普（？~215年），字德谋，右北平土垠（今河北丰润东今唐山市丰润区银城铺镇）人。东汉末年江东名将，历仕孙坚、孙策、孙权，在孙权时期于东吴诸将中年岁最长，被人们尊称为“程公”，在“江表之虎臣”中位列第一位。<br><br>程普曾跟随孙坚讨伐黄巾军，继而参加讨伐董卓的战斗，斩华雄、破吕布。孙坚死后，又助孙策平定江东。孙策曾经兵败被围，程普将孙策救出重围。在孙策死后，他与张昭、周瑜等人共同辅佐孙权，并讨伐江东境内的山贼，功勋卓著。在赤壁之战中，与周瑜为左右督，各领万人，于乌林打败曹操，后随周瑜大破曹仁、徐晃联军于南郡 。拜裨将军，领江夏太守，治沙羡，食四县。周瑜去世后一度代领南郡太守。建安二十年，程普在平叛后焚毁尸体，当日染疾，百余日后去世。<br><br>程普曾因不满周瑜年轻位高而对其轻侮，但相处一段时间后对周瑜愈加敬重，并称赞道：“与周公瑾交，如饮醇醪，不觉自醉”。",
  handang:
    "韩当（？~226），字义公。辽西郡令支县（今河北迁安）人。东汉末年至三国时期孙吴名将。韩当长于弓箭、骑术并且膂力过人。因受到孙坚赏识而加入孙坚麾下，并辅佐于孙坚、孙策、孙权三代，随从其征伐四方，功勋卓著，对江东基业的逐渐稳固和吴国的建立有着重要影响，被陈寿盛赞为“江表之虎臣”。官至昭武将军、冠军太守，加都督称号，封爵石城侯。",
  liubiao:
    "刘表（142年－208年），字景升，山阳郡高平县人。西汉鲁恭王刘余之后。刘表身长八尺余，姿貌温厚伟壮，少时知名于世，名列“八俊”。早年因参与太学生运动而受党锢之祸牵连，被迫逃亡，光和七年（184年），党禁解除，被大将军何进辟为掾，出任北军中候。后代王睿为荆州刺史，用蒯氏兄弟、蔡瑁等人为辅。李傕等入长安，刘表遣使奉贡，被任命为镇南将军、荆州牧、假节，封成武侯。在荆州期间，刘表恩威并著，招诱有方，使得万里肃清、群民悦服。又开经立学，爱民养士，从容自保。远交袁绍，近结张绣，内纳刘备，据地数千里，带甲十余万，称雄荆江，先杀孙坚，后又常抗曹操。然而刘表为人性多疑忌，好于坐谈，立意自守，而无四方之志，后更宠溺后妻蔡氏，使妻族蔡瑁等得权。建安十三年（208年），刘表病逝。蔡瑁等人废长立幼，奉表次子刘琮为主；曹操南征，刘琮举州投降，荆州遂没。",
}

export default characterIntro
