const characterIntro = {
  caozhi:
    "曹植（192年－232年12月27日），字子建，沛国谯县（今安徽亳州）人，是曹操与武宣卞皇后所生第三子，生前曾为陈王，去世后谥号“思”，因此又称陈思王。<br><br>曹植以文采斐然闻名于世，颇受曹操喜爱。曹操曾动过改立曹植为嗣子的念头，因贾诩等人劝谏，加上曹植个性放纵、酗酒，不是经世之才而作罢。在曹丕、曹叡时期屡遭贬徙，最终郁郁而死。<br><br>曹植在两晋南北朝时期，被推尊到文章典范的地位，东晋名士谢灵运评价“天下才有一车，曹子建独占八斗”。其诗以笔力雄健和词采华美见长，留有集三十卷，已佚，今存《曹子建集》为宋人所编。<br><br>在《三国杀》中，曹植是一将成名系列的第一位武将。",
  yujin:
    "于禁（？－221年），字文则，泰山钜平（今山东泰安）人。三国时期曹魏名将。<br><br>于禁原为鲍信部将，鲍信战死后被王朗不是这个王朗引荐给曹操，之后便随曹操南征北战，立下了许多战功。因为敢于攻击不守军纪的青州兵，且为了维护军法不惜杀掉自己的故友，被曹操称赞胜过古代名将。关羽围攻襄、樊时，于禁督七军前往救援，被关羽利用秋季大雨打得全军覆没，投降后被监押在南郡。而后关羽被吕蒙击败，于禁流落至东吴，孙权向魏国称藩后，将于禁送还魏国。虽然魏文帝曹丕表面安慰于禁，却暗里让人作壁画羞辱于禁，于禁因此惭恚而死，被恶谥为厉侯。<br><br>于禁带军严肃庄重，战斗中所缴获的财物从不私藏，因此深得曹操器重，是曹操麾下外姓将领中唯一一个假节钺的人。但同时于禁常以军法处理下属，不得士卒欢心。后世将于禁称为曹魏“五子良将”之一。",
  zhangchunhua:
    "宣穆皇后张春华（189年－247年），河内郡平皋县（今河南温县）人，曹魏粟邑令张汪之女，晋宣帝司马懿之妻，晋景帝司马师和晋文帝司马昭的母亲。<br><br>正始八年（247年），张春华去世，时年五十九岁，葬于洛阳高原陵，追赠广平县君。咸熙元年（264年），追谥为宣穆妃。泰始元年（265年），张春华之孙晋武帝司马炎登基，追谥她为宣穆皇后。",
  fazheng:
    "法正（176年－220年），字孝直。扶风郿（今陕西省眉县小法仪镇）人。东汉末年刘备帐下谋士，名士法真之孙。<br><br>原为刘璋部下，刘备围成都时劝说刘璋投降，而后又与刘备进取汉中，献计将曹操大将夏侯渊斩首。法正善奇谋，深受刘备信任和敬重。<br><br>建安二十四年（219年），刘备进位汉中王，封法正为尚书令、护军将军。次年，法正去世，终年四十五岁。法正之死令刘备十分感伤，连哭数日。被追谥为翼侯，是刘备时代唯一一位有谥号的大臣。但其实是因为死的早<br><br>法正善于奇谋，被陈寿称赞为可比曹操帐下的程昱和郭嘉。《全三国文》辑录有其文一篇。",
  masu: "马谡（190年―228年），字幼常，襄阳宜城（今湖北省宜城市）人，为侍中马良之弟，三国时期蜀汉官员、将领。<br><br>马谡最初以荆州从事的身份跟随刘备进入蜀地，先后任绵竹县令、成都县令和越嶲太守。马谡才气过人，喜好议论军事谋略，丞相诸葛亮对他深为器重，二人情同父子，但刘备临终前则告诫诸葛亮“马谡言过其实，不可大用”。建兴三年（225年），诸葛亮征南中，马谡提出的“心战为上，兵战为下”之策略为诸葛亮采纳，而南中终诸葛亮一世也不曾再度反叛。建兴六年（228年），诸葛亮兵出祁山伐魏，马谡献散谣之计以离间司马懿和曹叡，诸葛亮力排众议任命马谡为蜀军前锋，统领各军前行。马谡在街亭与魏将张郃交战，因马谡不听部将王平劝阻、不遵守诸葛亮的计划，而是屯兵险处，被张郃围困后击败，军队溃散，仅有王平所部顺利撤退，街亭也被魏军占领。诸葛亮知道街亭丢失后，只能率军退守汉中。马谡被捕，死于狱中（一说被诸葛亮按照军法处死；亦有说法马谡逃亡，向朗知情不报被免职），年仅三十九岁。",
  xushu:
    "徐庶，字元直。颍川郡长社县（今河南许昌长葛东）人。东汉末年刘备帐下谋士，后归曹操，病逝于曹魏。<br><br>徐庶本名徐福不是这个徐福，为寒门子弟。早年为人报仇，获救后改名徐庶，拜师求道。后与同郡石韬（字广元，与徐庶同期的一名谋士，与徐庶交好）避难于荆州，与司马徽、诸葛亮、崔州平等道友来往密切。刘备屯驻新野时，徐庶前往投奔，并向刘备推荐诸葛亮。徐庶南下时因母亲被曹操所掳获，徐庶不得已辞别刘备，进入曹营。后来此事被艺术加工为“徐庶进曹营，一言不发”等歇后语，被广为流传。而徐庶也成为孝子的典范被加以称赞。魏文帝时，徐庶官至右中郎将、御史中丞。在诸葛亮北伐行军至陇右（今陕甘边界六盘山西部地区）之时听见徐庶与石韬在曹魏不被重用的消息时曾感叹道：“魏殊多士邪！何彼二人不见用乎？（魏国谋士这么多吗？为什么不重用徐庶石韬二人呢？）”",
  lingtong:
    "凌统（189年－217年），字公绩，吴郡馀杭（今浙江杭州市余杭区）人，凌操之子。少有盛名，为别部司马，行破贼校尉。建安十三年（208年），孙权再次攻打江夏，凌统部队为先锋，斩敌将张硕，破其水军，吴军最终得以斩黄祖，大胜而还。被孙权任为承烈都尉。之后，随周瑜在乌林大败曹操，攻打曹仁所在的江陵，使曹仁退走。<br><br>先前凌统之杀父仇人甘宁投奔孙权。凌统怨恨甘宁，甘宁也防备凌统，尽量避免和他见面。孙权命令凌统，不得与甘宁为仇。曾经两人在吕蒙住处宴会，酒酣，凌统以刀起舞，甘宁说：“我能以双戟为舞。”吕蒙说：“你虽然可以，不如我的舞巧妙。”于是操刀持盾分开他们。孙权知道凌统的意思，于是让甘宁领兵屯于半州。<br><br>建安二十年（215年），随军攻破皖城，升为荡寇中郞将，任沛国丞相。又随吕蒙夺取长沙、零陵、桂阳三郡，夺取三郡后回师，从益阳直往合肥，时为右部督。当时，孙权决定从合肥撤军，前部兵已然出发，魏军将领张辽等忽然冲到逍遥津北边，孙权让前头兵转回来，但是部队已走远了，一时开不回来，以致凌统和亲兵三百人被魏军包围，好容易才救孙权出了围。孙权、甘宁蹴马趋津，逃至逍遥津边，但是敌人破坏了桥梁，只剩下两条长板。幸而谷利著鞭助势，使得孙权快马跳过桥。凌统则转回迎战，左右的人全都阵亡，凌统也受了伤，还奋力杀死几十个敌兵，一直到估量着孙权脱了险，凌统才肯退下来，而桥断路绝，他就穿着铠甲潜入水中进行潜泳。在撤军途中，孙权已经到了船上，忽然见到凌统活着回来，既大惊又大喜。<br><br>建安二十二年（217年）病逝，年仅二十七岁。",
  wuguotai:
    "吴国太，小说《三国演义》中的人物，不见于正史记载。在小说中，吴国太被描述为孙坚的次妻，孙坚正妻武烈皇后（小说中写作吴太夫人）的妹妹，孙朗、孙尚香的母亲，原型是孙坚之妾丁氏。<br><br>注：吴国太和正史中的吴夫人（武烈皇后）是两个人，其称号“武烈皇后”完全属于误用，切勿混为一谈！",
  xusheng:
    "徐盛（生卒年不详），字文向，琅邪莒县（今山东省莒县）人。黄祖的儿子黄射曾经率领数千人南下柴桑，攻击徐盛。徐盛以不到二百人的兵力抵抗，杀伤黄射的部队千余人。其后开门主动出战，大败黄射，黄射被击退后再也不敢前来侵犯。因功升为中郎将。在濡须浴血奋战。刘备伐吴时，徐盛跟随陆逊攻下蜀军多处屯营；曹休伐吴时，徐盛在形势不利的情况下以少抗多，成功防御。因前后战功，徐盛先后升任建武将军、安东将军，任庐江太守。后来，曹丕大举攻吴，吴国依徐盛的建议在建业外围筑上围墙，曹丕中疑城之计而退走。黄武年间，徐盛病逝。",
  chengong:
    "陈宫（？－199年2月7日），字公台，东汉末年吕布帐下首席谋士，东郡东武阳（今山东莘县）人。性情刚直，足智多谋，年少时与海内知名之士相互结交。192年，兖州刺史刘岱在讨伐青州黄巾时战死，陈宫等人主张曹操接任兖州牧因而被曹操视为心腹。但此后陈宫因曹操杀害边让等汉末名士而与曹操反目，并游说张邈背叛曹操迎吕布入兖州，辅助吕布攻打曹操并先后取得兖州与徐州。下邳城中，吕布不听陈宫两面互补之计，以致失败。吕布战败后，随吕布等一同被曹操所擒，决意赴死。",
  gaoshun:
    "吕布帐下中郎将。史载高顺为人清白有威严，不好饮酒，所统率的部队精锐非常，号称“陷阵营”。屡进忠言于吕布，吕布虽知其忠而不能用。曹操击破吕布后，高顺被曹操所杀。",

  zhonghui:
    "钟会（225年－264年3月3日），字士季，颍川长社（今河南长葛）人。三国时期魏国军事家、书法家，太傅钟繇幼子、青州刺史钟毓之弟。随从司马师征讨毌丘俭，典知机密。献策于司马昭，粉碎曹髦的复权企图。随军平定诸葛诞叛乱，屡出奇谋，时人比之为张良。景元年间，力挺司马昭伐蜀计划，拜镇西将军、假节、都督关中诸军事，主持伐蜀事宜。景元四年（263年），魏灭蜀之战中，配合邓艾分兵进取，最终灭亡蜀汉。拜司徒，封县侯。功成之后，萌生不臣之心，勾结蜀将姜维，图谋据蜀自立，打压太尉邓艾。景元五年（264年）正月，以郭太后遗命之名，矫诏讨伐司马昭，为部将胡烈所害，死于乱军，时年四十岁。",
  wangyi:
    "王异（或作士异），东汉末年曹操设置的羌道令、益州刺史赵昂之妻，赵英、赵月之母。<br><br>马超作乱凉州时，王异协助丈夫守城，多有功勋，自马超攻冀城至祁山坚守，赵昂曾出奇计九条，王异皆有参与。",
  xunyou:
    "荀攸，字公达，颍川颍阴（今河南许昌）人。荀彧之侄，东汉末年谋士。<br><br>荀攸在何进掌权时期任黄门侍郎，在董卓进京时曾因密谋刺杀董卓而入狱，后弃官回家。 曹操迎天子入许都之后，荀攸成为曹操的军师。 曹操征伐吕布时荀攸劝阻了曹操退兵，并献奇计水淹下邳城，活捉吕布。<br><br>在官渡之战中，计斩颜良文丑，又策奇兵派徐晃烧袁绍粮草，又力劝曹操采纳许攸之计奔袭乌巢，又力劝曹洪接纳张郃、高览，皆立下大功。<br><br>建安八年（203年），刘表强盛。荀攸力排众议，主张趁袁绍诸子不和而先攻河北，被曹操上奏朝廷封为陵树亭侯。荀攸行事周密低调，计谋百出，深受曹操称赞。建安十九年（214年），荀攸在曹操伐吴途中去世。谥曰敬侯。<br><br>荀攸被称为曹操的“谋主”，擅长灵活多变的克敌战术和军事策略。他生前设奇策共十二计，只有钟繇知道。钟繇整理未全就去世了，故后世不得而知。",
  guanzhang:
    "关兴，字安国，生卒年不详，河东解县（今山西运城）人，汉末名将关羽次子，关平之弟。关兴从小就有好名声，丞相诸葛亮十分器重他，成年后，在蜀汉担任侍中、中监军之职，继承父亲汉寿亭侯的爵位几年后病亡。有子关统、关彝。《三国志 蜀书 关张马黄赵传第六》记载“（关羽）子兴嗣。兴字安国，少有令问，丞相诸葛亮深器异之。弱冠为侍中、中监军，数岁卒。子统嗣，尚公主，官至虎贲中郎将。卒，无子，以兴庶子彝续封。”<br><br>张苞（201年－231年），三国时期蜀汉武将、官员，蜀汉名将张飞的长子，早夭。《三国志 蜀书 关张马黄赵传第六》记载“（张飞）长子苞，早夭。次子绍嗣，官至侍中尚书仆射。苞子遵为尚书，随诸葛瞻于绵竹，与邓艾战，死。”<br><br>《三国演义》中俩人也学父辈义结金兰，并称“小关张”。",
  liaohua:
    "廖化（？－264年），本名淳，字元俭，荆州襄阳郡中卢县（今湖北省襄阳市）人。三国时蜀汉将领。<br><br>关羽败亡后，归属孙吴，用诈死之计回归蜀汉，被刘备授为宜都太守。刘备去世后，转拜丞相参军，后为广武都督，迁阴平太守，多次参与蜀汉的北伐。官至右车骑将军，假节，领并州刺史，封中乡侯。蜀汉灭亡后，被迁往洛阳，于中途病逝。",
  madai:
    "马岱，表字不详，生卒年不详，扶风茂陵（今陕西省兴平市）人。马超的从弟，蜀汉将领。早年追随马超大战曹操，反攻陇上，围攻成都，汉中之战等。后在诸葛亮病逝后受杨仪派遣斩杀了蜀将魏延。曾率领军队出师北伐，被魏将牛金击败而退还。官至平北将军，陈仓侯。",
  bulianshi:
    "步练师（？－238年），临淮淮阴（今江苏省淮安市）人，吴大帝孙权的宠妃。丞相步骘族人。步练师生有二女全公主和朱公主。孙权即帝位，拜为夫人。宫中以皇后礼节待之。赤乌元年（238年），步练师去世，追封皇后，葬于蒋陵。",
  chengpu:
    "程普（？~215年），字德谋，右北平土垠（今河北丰润东今唐山市丰润区银城铺镇）人。东汉末年江东名将，历仕孙坚、孙策、孙权，在孙权时期于东吴诸将中年岁最长，被人们尊称为“程公”，在“江表之虎臣”中位列第一位。<br><br>程普曾跟随孙坚讨伐黄巾军，继而参加讨伐董卓的战斗，斩华雄、破吕布。孙坚死后，又助孙策平定江东。孙策曾经兵败被围，程普将孙策救出重围。在孙策死后，他与张昭、周瑜等人共同辅佐孙权，并讨伐江东境内的山贼，功勋卓著。在赤壁之战中，与周瑜为左右督，各领万人，于乌林打败曹操，后随周瑜大破曹仁、徐晃联军于南郡 。拜裨将军，领江夏太守，治沙羡，食四县。周瑜去世后一度代领南郡太守。建安二十年，程普在平叛后焚毁尸体，当日染疾，百余日后去世。<br><br>程普曾因不满周瑜年轻位高而对其轻侮，但相处一段时间后对周瑜愈加敬重，并称赞道：“与周公瑾交，如饮醇醪，不觉自醉”。",
  handang:
    "韩当（？~226），字义公。辽西郡令支县（今河北迁安）人。东汉末年至三国时期孙吴名将。韩当长于弓箭、骑术并且膂力过人。因受到孙坚赏识而加入孙坚麾下，并辅佐于孙坚、孙策、孙权三代，随从其征伐四方，功勋卓著，对江东基业的逐渐稳固和吴国的建立有着重要影响，被陈寿盛赞为“江表之虎臣”。官至昭武将军、冠军太守，加都督称号，封爵石城侯。",
  liubiao:
    "刘表（142年－208年），字景升，山阳郡高平县人。西汉鲁恭王刘余之后。刘表身长八尺余，姿貌温厚伟壮，少时知名于世，名列“八俊”。早年因参与太学生运动而受党锢之祸牵连，被迫逃亡，光和七年（184年），党禁解除，被大将军何进辟为掾，出任北军中候。后代王睿为荆州刺史，用蒯氏兄弟、蔡瑁等人为辅。李傕等入长安，刘表遣使奉贡，被任命为镇南将军、荆州牧、假节，封成武侯。在荆州期间，刘表恩威并著，招诱有方，使得万里肃清、群民悦服。又开经立学，爱民养士，从容自保。远交袁绍，近结张绣，内纳刘备，据地数千里，带甲十余万，称雄荆江，先杀孙坚，后又常抗曹操。然而刘表为人性多疑忌，好于坐谈，立意自守，而无四方之志，后更宠溺后妻蔡氏，使妻族蔡瑁等得权。建安十三年（208年），刘表病逝。蔡瑁等人废长立幼，奉表次子刘琮为主；曹操南征，刘琮举州投降，荆州遂没。",

  caochong:
    "曹冲（196年-208年，一说198年-210年），字仓舒，曹操和环夫人之子。从小聪明仁爱，与众不同，深受曹操喜爱。曹操几次对群臣夸耀他，有让他继嗣之意。但曹冲还未成年就病逝，年仅十三岁。留有“曹冲称象”和“智救库吏”的典故。",
  guohuai:
    "郭淮（？—255年2月23日），字伯济。太原阳曲（今山西太原）人。东汉末年，举孝廉出身，任平原郡丞。定军山战败时，收集残兵，联合杜袭共推张郃为主将，迅速稳定局势。曹魏建立后，拜雍州刺史、射阳亭侯，阻止诸葛亮北伐，料敌准确，屡立战功。正始元年（240年），击退姜维，迁前将军。正元二年（255年），去世，追赠大将军，谥号为贞。",
  manchong:
    "满宠（？—242年），字伯宁，山阳昌邑（今山东省巨野县）人。三国时期魏国著名酷吏、将领。<br><br>最初在曹操手下任许县县令，掌管司法，以执法严格著称；转任汝南太守，开始参与军事，曾参与赤壁之战。后关羽围攻樊城，满宠协助曹仁守城，劝阻了弃城而逃的计划，成功坚持到援军到来。曹休去世后，满宠转任到扬州，接任征东将军，负责东侧对吴作战满数十。后因年迈调回中央任太尉，数年后病逝，谥号景侯。",
  guanping:
    "关平（？-220），东汉末年名将关羽的长子。关羽率军攻打樊城时，孙权背弃盟约派遣吕蒙偷袭荆州，吕蒙成功袭取荆州后，关羽因后方失守被迫从前线战场撤退。因为关羽的大本营江陵被东吴军攻占，关羽军中所有将士的全家老小都被东吴军控制，从而引发关羽军将士大溃散。关平与其父在撤退到麦城时中了东吴军埋伏一同被擒，最后一起被斩于临沮县。",
  jianyong:
    "简雍（生卒年不详），字宪和。涿郡（今河北省涿州市）人。本姓耿，而幽州人将耿说成简，便改为姓简。东汉末年至三国时期刘备帐下谋士。<br><br>简雍年少时便与刘备相识，后随其奔走。常作为谈客，往来使命，刘备围成都时，简雍劝说益州牧刘璋投降。不久，官拜昭德将军，地位次于麋竺。<br><br>简雍擅于辩论、议事。性情简单直接、不拘小节。与刘备同坐时，亦盘腿而坐，不理威仪。与除诸葛亮外的人相处时，他都独占一榻，卧姿对话，从不屈就于人。",
  liufeng:
    "刘封（？—220年），东汉末年长沙（治今湖南湘阴）人，东汉末年将领，原为罗侯寇氏之子，后被刘备收为养子。有武艺，性格刚猛，气力过人。后来关羽北伐曹魏，多次要求刘封起兵相助，刘封不从。而后又侵凌孟达，迫其降魏。孟达与徐晃共袭刘封，并劝刘封投降，刘封不降，又遭部下叛变，败归成都。刘备在诸葛亮的建议下赐死刘封，刘封自裁，刘备深表痛惜。",
  panzhangmazhong:
    "潘璋（？－234年），字文珪，东郡发干（今山东冠县东）人。潘璋年轻时家贫，跟随孙权后得到其赏识，加上其作战勇猛，不断升迁，其一生为孙权东征西讨，在合肥之战、追擒关羽、夷陵之战、江陵保卫战中多次立下战功。但其为人奢侈贪财。经常设立军市，又劫杀将士以获得财物，但孙权念其有功未予深究。公元227年（黄武六年），孙权亲自率军在石亭迎击魏军，吴军大胜，准备回师，以潘璋为断后。不过，在夜中发生乱事，敌人追击潘璋，潘璋不能抵挡，幸而朱然解救。潘璋为人鲁莽勇猛，禁令严明，喜好建功立业，带领人马不过几千人，但所到之处常常可以起到上万兵力的作用。公元234年（嘉禾三年），潘璋去世，孙权下令其部队交由吕岱接管。潘璋儿子潘平行为不端而被流放会稽。<br><br>马忠，生卒年不详，潘璋部下司马。建安二十四年（219）吴将吕蒙攻关羽，忠于临沮俘获关羽及其子关平等，遂定荆州。<br><br>在《三国演义》中，这两个人全部在夷陵之战的时候战死。",
  yufan:
    "虞翻（164年～233年），字仲翔，会稽余姚（今浙江省余姚市）人。三国时期吴国学者，日南太守虞歆的儿子。<br><br>虞翻勤奋好学，早年担任会稽太守王朗的功曹，后投奔孙策，成为东吴重要谋臣。后来得罪孙权，被流放交州，最终死于岭南。他既可日行三百，又善使长矛，还研究经学，精通《易经》，兼通医术，可谓文武全才。孙权曾称赞其可与东方朔为比。",
  zhuran:
    "朱然（182年—249年），原名施然，字义封，丹阳故鄣（今浙江安吉）人。<br><br>毗陵侯朱治的外甥，早年被朱治收为养子。孙权统事后，朱然历任余姚长、山阴令、临川太守，加折冲校尉，率军平定山贼。曾随吕蒙擒杀关羽，以功迁昭武将军，封西安乡侯。吕蒙死后，朱然代替吕蒙镇守江陵。<br><br>夷陵之战中，与陆逊合力大破刘备，拜征北将军，封永安侯。魏国趁机攻吴，朱然坚守不出，曹真、夏侯尚、张郃等魏将围攻江陵六月之久，朱然从此名震敌国。<br><br>赤乌十二年（249年），朱然病逝，享年68岁。在《三国演义》中则是直接于夷陵战役追击刘备时被来接应的赵云一枪刺死。",
  fuhuanghou:
    "伏寿（？—214年），汉献帝皇后，琅琊郡东武县（今山东诸城）人，西汉大司徒伏湛八世孙，父亲是学者伏完，嫡母为阳安长公主刘华。作为皇后二十年，于建安十九年被曹操幽闭而死。",
  liru: "李儒 ，字文优（《曹全碑》载），司隶左冯翊郃阳（今陕西省渭南市合阳县）人，东汉末年的博士、弘农王郎中令。董卓专政时，李儒奉董卓之命，入宫毒死刘辩。董卓死后，李傕攻进长安，控制朝政，李傕推举博士李儒为侍中，但被汉献帝拒绝。198年李傕被曹操击败，此后李儒的事迹及下落史书均无记载。",

  caozhen:
    "曹真，曹魏名将，曹操养子，字甄子丹。曹操因赞赏曹真的勇猛而让他参与虎豹骑。历任偏将军、中领军、征蜀护军等职，并参与汉中之战。魏明帝曹叡即位后，拜大将军，进爵邵陵侯。多次率军抵御蜀汉丞相诸葛亮的北伐。",
  chenqun:
    "陈群（？－237年2月7日），字长文。颍川郡许昌县（今河南许昌东）人。东汉太丘长陈寔之孙、大鸿胪陈纪之子。早年被刘备辟为豫州别驾。当时，徐州牧陶谦病死，徐州以举州迎刘备继领，陈群劝阻，刘备不听，还是东进徐州，与袁术争战。结果吕布果然兵袭下邳，又遣兵往助袁术，最终大破刘备军，刘备这时候才悔恨当初没听陈群的劝告。建安三年（198年），吕布为曹操所破，陈群父子亦在吕布军中，见曹操皆出拜。建安四年（199年），陈纪去世，陈群因此辞官。后任司徒掾，举高第，为治书侍御史，转参丞相军事。<br><br>延康元年（220年），曹丕即王位后，封陈群为昌武亭侯，徙为尚书。其间，陈群建制九品官人之法，成为历史名制。黄初六年（225年），曹丕亲征孙权，军至广陵，使陈群领中领军。黄初七年（226年）五月丙辰，曹丕得疾甚危，陈群与曹真、司马懿等并受遗诏辅政。十二月，陈群又升为司空，故录尚书事。<br><br>青龙四年十二月二十四日，陈群逝世，谥曰靖侯。其子陈泰嗣任。",
  hanhaoshihuan:
    "韩浩，字元嗣 ，河内郡（治所在今河南武陟西南）人 ，东汉末年曹操麾下将领。东汉末年天下大乱，韩浩聚徒众护县。河内太守王匡征召韩浩为从事，领兵在盟津拒抗董卓。董卓执其舅杜阳招引韩浩，韩浩不从，因而知名。袁术任命韩浩为骑都尉。后夏侯惇奇其才，使韩浩领兵跟从征伐。韩浩与史涣因忠勇而闻名，都是曹操的心腹将领，被委以执掌禁军的重责。时荒乱乏粮，韩浩议急农救荒，曹操遂兴屯田，升任韩浩为护军。随军攻克柳城，改任中护军，置长史、司马，封万岁亭侯。从破张鲁，议者欲留韩浩镇守汉中，都督诸军。曹操不舍韩浩，带他回到都城。韩浩死后，其养子韩荣继嗣爵位。<br><br>史涣（？-209年），字公刘，豫州沛国（今安徽淮北）人。东汉末年在曹操帐下将领。年少任侠，有雄气，以忠诚勇敢著称。 曹操起兵后，以门客身份加入，行中军校尉，从军征伐，监督诸将。199年，与曹仁共督于禁、徐晃等人攻打眭固于犬城，功劳居最；200年，官渡大战，与徐晃一起烧掉韩猛护送的粮车。207年，拜为中领军，进封列侯。建安十四年（209年），去世，其子史静继承其爵位。",
  wuyi: "吴懿（？－237年），一作吴壹，字子远。兖州陈留（今河南省开封市）人。三国时期蜀汉将领、外戚，蜀汉穆皇后吴氏的兄长。<br><br>吴懿初随刘焉入蜀，刘璋时任中郎将。刘备进攻刘璋，吴懿归降刘备，历任讨逆将军、护军、关中都督。后随蜀汉丞相诸葛亮北伐曹魏，并与魏延在阳溪大破魏将郭淮，升任左将军，进封高阳乡侯。诸葛亮逝世后，任汉中都督，升任车骑将军、雍州刺史、假节，又进封济阳侯。建兴十五年（237年）去世。",
  zhangsong:
    "张松（？~212），字紫乔子乔，蜀郡成都（今四川成都）人。建安十三年（208年），为益州牧刘璋别驾从事，被派遣至曹操处而不为其所存录，因而怀怨恨，并认为其并不能成就大业。回蜀后，劝刘璋与曹操断绝关系，并说刘璋连好刘备；其后，又说服刘璋迎接刘备以击张鲁。建安十七年（212年），暗助刘备，为其兄张肃所告发，刘璋怒而将他斩杀。",
  zhoucang:
    "周仓，字元福，是历史小说《三国演义》中的人物，在《山西通志》中也有记载，但是在《三国志》中无记载。其形象为身材高大、黑面虬髯的关西大汉，本是黄巾军出身，关羽千里寻兄之时请求跟随，自此对关羽忠心不二；在听说关羽兵败被杀后，周仓也自刎而死。在《三国演义》及此后的各种民间传说中，周仓均以关羽护卫的形象出现，在各地的关帝庙中，关羽神像的两侧也经常供奉周仓、关平的神像。",
  guyong:
    "顾雍（168~243），为蔡邕之徒。其为人少言语，不饮酒，严厉正大，被张纮推荐仕于孙权。孙权任命他为会稽郡丞，行太守事，后不断升迁，官至吴国丞相。顾雍为官，多进良言有功于吴。",
  sunluban:
    "孙鲁班（生卒年不详），字大虎，吴郡富春人。吴大帝孙权和步皇后长女，初嫁周瑜的儿子周循，后再嫁成为右大司马全琮之妻（因此常被称为全公主）。全怿、全吴生母，全绪、全寄继母。<br><br>吴国中期，由于孙权对她的宠重，她一度权倾一时，形成了一股强大的政治势力，左右了吴国政局。",
  zhuhuan:
    "朱桓（177年－238年），字休穆，吴郡吴县（今江苏苏州）人，三国时期吴国名将，骠骑将军朱据从兄、镇南将军朱异之父。朱桓官至前将军、青州牧，假节，封为嘉兴侯。出身江东吴郡四大姓之一吴郡朱氏。",
  caifuren:
    "蔡夫人，生卒年不详。刘表后妻，刘琮和刘琦的后母，荆襄一带的豪族蔡氏家族的一员，黄月英的姨母。<br><br>因刘琮娶了自己的侄女所以对其偏爱有加，常毁刘琦而誉刘琮于表。表死，与蔡瑁等共排表长子刘琦，奉刘琮为嗣，寻降曹操。",
  jushou:
    "沮授（？—200），袁绍帐下谋士。史载他“少有大志，擅于谋略”。曾为冀州别驾，举茂才，并当过两次县令。后来又当韩馥别驾，被韩馥表为骑都尉。袁绍占据冀州后任用沮授为从事。经常对袁绍提出良策，但很多时候袁绍并不听从。官渡之战时袁绍大败，沮授未及逃走，被曹操所获，因拒降被曹操处死。",

  caorui:
    "曹叡（204年－239年1月22日），字元仲，沛国谯县（今安徽亳州）人。魏文帝曹丕长子。黄初三年（222年），曹叡封平原王，黄初七年（226年）五月，魏文帝病重，立曹叡为皇太子，即位于洛阳。曹叡在位期间指挥曹真、司马懿等人成功防御了吴、蜀的多次攻伐，并且平定鲜卑，攻灭公孙渊，设置律博士制度，重视狱讼审理，与尚书陈群等人制《魏律》十八篇，是古代法典编纂史上的重大进步。魏明帝在军事，政治和文化方面都颇有建树，但在统治后期大兴土木，广采众女，因此留下负面影响。<br><br>景初三年（239年），曹叡病逝于洛阳，时年三十六岁，庙号烈祖，谥号明帝，葬于高平陵。",
  caoxiu:
    "曹休（？－228年11月8日），字文烈，沛国谯县（今安徽亳州）人，三国曹魏将领，曹操族子（其父是曹操从弟）。根据曹休墓发掘的男性人骨鉴定，曹休活到50岁左右。<br><br>曹休于曹操起兵讨伐董卓时前往投奔，被称为“千里驹”。曹操对他如同亲子，并使他领虎豹骑宿卫。汉中之战时，曹休识破张飞计谋，大败吴兰。曹魏建立后，镇守曹魏东线，都督扬州，多次击破吴军，诱降吴将周鲂：嘿嘿嘿。曹丕驾崩，曹休受遗诏成为四大辅政大臣之一。曹叡即位后，官至大司马，成为曹魏军队的最高统帅，封长平侯。<br><br>太和二年（228年），曹休在魏吴石亭之战中大败，不久因背上毒疮发作而去世，谥号为壮。",
  zhongyao:
    "锺繇（yáo，一作yóu）（151年－230年），字元常。颍川长社（今河南许昌长葛东）人。三国时期曹魏著名书法家、政治家。<br><br>锺繇早年相貌不凡，聪慧过人。历任尚书郎、黄门侍郎等职，助汉献帝东归有功，封东武亭侯。后被曹操委以重任，为司隶校尉，镇守关中，功勋卓著。以功迁前军师。魏国建立，任大理，又升为相国。曹丕称帝，为廷尉，进封崇高乡侯。后迁太尉，转封平阳乡侯。与华歆、王朗并为三公。明帝继位，迁太傅，进封定陵侯。太和四年（230年）卒，谥曰成。<br><br>锺繇在书法方面颇有造诣，是楷书（小楷）的创始人，被后世尊为“楷书鼻祖”。锺繇对后世书法影响深远，王羲之等后世书法家都曾经潜心钻研学习锺繇书法。与东晋书法家王羲之并称为“锺王”。南朝庾肩吾将锺繇的书法列为“上品之上”，唐张怀瓘在《书断》中则评其书法为“神品”。",
  liuchen:
    "刘谌（？—263年），涿郡涿县（今河北涿州）人，蜀汉昭烈帝刘备之孙，蜀汉后主刘禅第五子，三国时期蜀汉北地王。景耀二年（259年），刘禅封其为北地王。景耀六年（263年），邓艾军队兵临成都门下，其父刘禅决定投降，刘谌劝阻无效之后，于昭烈庙杀死自己妻儿后自杀。",
  xiahoushi:
    "夏侯氏（187年或188年－？），沛国谯（今安徽亳州）人。东汉末年夏侯渊从女，夏侯霸从妹，蜀汉名将张飞之妻，统称夏侯夫人。在动画片三国演义中，名为夏侯涓。",
  zhangyi:
    "张嶷（？－254年），字伯岐，巴郡南充国县（今四川南部县）人。初为县功曹。刘备定蜀时山贼趁机抢掠县里，张嶷背着县长夫人，将其救出，张嶷因此得名。<br><br>后诸葛亮预备北伐时，张嶷平定了在广汉作乱的贼寇。其后被任命为牙门将，随马忠多次平定南蛮叛乱，因功封为越巂（）太守。在郡十五年，平定当地叛乱，将破败的城郭重新建设，又打通了越巂郡到成都的道路，甚得民心。后被征召回成都，越巂民感到悲伤，甘愿随张嶷至成都的越巂头目达百余人。官至荡寇将军，封关内侯。<br><br>延熙十七年（254年），带病与魏将徐质交战，杀敌过倍，但最终寡不敌众，战死沙场。张嶷死后，越巂郡民无不流涕，并为其立庙，四时祭祀。",
  quancong:
    "全琮（？～249年），字子璜，吴郡钱唐（今浙江省杭州市）人。三国时期吴国名将，桂阳太守全柔之子。<br><br>早年仁义，赈济灾民。起家奋威校尉，参与讨伐山越。募兵守卫牛渚，迁偏将军。参加洞口之战，加号绥南将军，进封钱唐侯，授九江太守。参加石亭之战，配合辅国将军陆逊，大败曹魏大司马曹休，迁东安郡守。<br><br>黄龙元年（229年），迁卫将军、左护军、徐州牧，娶孙权长女孙鲁班，阻止太子孙登出征。赤乌四年（241年），出任大都督，大战魏将王凌于芍陂。赤乌九年（246年），迁右大司马、左军师，阻止孙权围攻珠崖和夷州，没有得到采纳。",
  sunxiu:
    "吴景帝孙休（235年-264年9月3日），字子烈，吴郡富春县（今浙江省杭州市富阳区）人，吴大帝孙权第六子 ，东吴第三位皇帝（258年11月30日–264年9月3日在位）。<br><br>孙休十八岁时，受封为琅琊王。太平三年（258年），孙𬘭发动政变，罢黜孙亮为会稽王，迎立孙休为帝，孙休三让而受，改元永安。<br><br>孙休登基后，封孙𬘭为丞相。孙𬘭权倾朝野，孙休与张布、丁奉合谋，遂除孙𬘭。孙休在位期间，颁布良制，嘉惠百姓，促进了东吴的繁荣。孙休好文，即位后于永安元年创建国学，设太学博士制度，诏立五经博士，为南京太学之滥觞，韦昭为首任博士祭酒。<br><br>永安六年（263年），魏灭蜀汉，孙休因此日夜忧惧，一年后驾崩，谥号景皇帝，葬于定陵。",
  zhuzhi:
    "朱治（156年-224年），字君理。丹杨故鄣人。三国时期吴国武将，东吴名将朱然之嗣父。早年随从孙坚、孙策征伐，又辅助孙权，稳定江东，功勋卓著。此后长期居住在吴郡，孙权为吴王，拜其为安国将军，配金印紫绶，封毗陵侯。每次进见，孙权都亲自迎接。黄武三年（224年）卒，年六十九。",
  gongsunyuan:
    "公孙渊（？－238年），字文懿。辽东郡襄平县（今辽宁辽阳）人。三国时辽东地方割据军阀。辽东太守公孙度之孙、左将军公孙康之子。太和二年（228年），夺其叔公孙恭位，后遣使南通孙权，孙权立其为燕王，并遣甲士万人携珍宝前往辽东，公孙渊害怕魏国讨伐，于是斩送吴使首至洛阳。景初元年（237年），在击败前来讨伐的毌丘俭等后叛魏，自立为燕王，明帝遣太尉司马懿率军四万讨之。公孙渊大败，为魏军所斩。",
  guotufengji:
    "郭图（？－205年），字公则，颍川人。早期为颍川太守阴修部下计吏，初平二年（191年），辛评、荀谌、高干、张导及郭图共同说服韩馥出让冀州牧予袁绍，郭图受邀成为袁绍谋士。官渡之战时力主趁机偷袭曹营，在此计失败后为免于责罚而归罪于率军偷袭曹营的张郃、高览，致使二人背袁投曹。袁绍死后为其长子袁谭效力，于205年和袁谭一同被曹操所杀。<br><br>逢纪（？-202年），字元图，南阳人。公元189年（中平六年），袁绍逃离董卓势力范围时，与逢纪、许攸同到冀州。袁绍甚为赏识逢纪的智谋而重用。初平二年（191年），逢纪提议利用公孙瓒攻击韩馥，实则提议韩馥和袁绍共同防御冀州，结果袁绍成功反客为主。建安五年（200年），袁绍在官渡之战败回，后悔当初不听田丰之计，逢纪即时进言田丰知道袁绍兵败后取笑袁绍不听其言。建安七年，袁绍去世，逢纪、审配私下改袁绍遗命，立袁尚继位。袁谭不能继位，自称车骑将军，屯黎阳。袁尚不给袁谭多兵，使逢纪随之。袁谭要求配兵为审配拒绝，一怒之下杀了逢纪。<br><br>但是，在三国杀中，〖急攻〗和〖饰非〗的典故皆出自郭图，与逢纪毫无关系，甚至引发了官方吐槽。而且这两人并非同一派系，在一起很奇怪。",

  qinmi:
    "秦宓（？－226年），字子敕。广汉郡绵竹县（今四川德阳北）人。三国时期蜀汉大臣、学者。<ul><li>早年仕于益州牧刘璋麾下，后降刘备。刘备伐吴时，秦宓劝阻，刘备大怒，欲杀秦宓。因诸葛亮及时求情，才保住性命，仅被下狱，后被释放，拜左中郎将、长水校尉。<li>吴蜀同盟后，孙权派张温至成都回访。酒宴之上，秦宓与张温舌战，说得张温无言以对。<li>“秦宓始慕肥遁之高，而无若愚之实。然专对有馀，文藻壮美，可谓一时之才士矣。”</ul>——《三国杀》中的三个技能：〖谏征〗、〖天辩〗、〖专对〗便是以以上三条事迹与评价为原型。",
}

export default characterIntro
