const characterIntro = {
  xinxianying:
    "辛宪英（191~269），曹魏重臣辛毗之女，曹魏著名才女。<br><br>二十岁时，便因曹丕的狂喜失态断定其不得长久；高平陵之变时劝弟辛敞尽忠职守，从而令其既不失于义又保全性命；后看出钟会野心，教导随钟会伐蜀的儿子仁恕谨慎，使其全身而归。侄子羊祜曾送其锦被，其嫌被华美将被面朝里使用，为人俭约至此。最终高寿而逝。",
  xuelingyun:
    "薛灵芸，东晋王嘉志怪小说《拾遗记》中的人物，魏文帝曹丕的宫人，妙于针工，虽处于深帷之内，不用灯烛之光，裁制立成。凡不是薛灵芸缝制的衣服，文帝一概不穿，宫中号为针神。<br><br>薛灵芸的故事在正史中虽无记载，却由于许多野史笔记偶尔提及，如《拾遗记》、《太平广记》、《艳异编》等，渐于后世成为中国古代著名美女形象。",
  tianshangyi:
    "田尚衣，一作陈尚衣，魏文帝曹丕宫中著名宫人。能歌善舞，一时冠绝于世。<br><br>其事不见于《三国志》，最早见于崔豹《古今注》。",
  huaman:
    "花鬘，古典戏曲《龙凤巾》（一名《化外奇缘》）中的人物，身份为三国时期南蛮王孟获与祝融夫人的女儿，关索的夫人之一。虚构人物你还想要啥人物简介",
  zhugeguo:
    "诸葛果，传说中诸葛亮的女儿。容貌甚伟，时人异焉。出生时，野外仙气缥缈、白鹤环绕，生来天资聪慧，对道学由衷热爱。成都西南有朝真观，即乘烟观，相传，诸葛果在这里避战乱，最终修成仙道，羽化升天。",
  ruiji:
    "芮姬，芮玄之女。黄初六年（225年），孙权为孙登娉娶芮玄的女儿为妃。<br><br>《三国志·吴书·潘濬陆凯传第十六》：“权为子登拣择淑媛，群臣咸称玄父祉兄良并以德、义、文、武显名三世，故遂娉玄女为妃焉。”<br><br>所以这个原画和技能跟这人有什么关系吗<br><br>但确实很可爱",
}

export default characterIntro
