const translates = {
  re_xinxianying: "辛宪英",
  rezhongjian: "忠鉴",
  rezhongjian_info:
    "出牌阶段限一次，你可以选择一名角色并选择一项直到你的下回合开始：1.其下次造成伤害后弃置两张牌，你摸一张牌；2.其下次受到伤害后摸两张牌，你摸一张牌。",
  recaishi: "才识",
  recaishi_info:
    "摸牌阶段结束时，你可以展示你本阶段摸的牌，若花色：相同，本回合〖忠鉴〗改为“出牌阶段限两次”（不能选择相同的角色）；不同，你可以回复1点体力，然后本回合不能对自己使用牌。",

  xuelingyun: "薛灵芸",
  xialei: "霞泪",
  xialei_info:
    "当你的红色牌进入弃牌堆后，你可以观看牌堆顶的三张牌，然后获得其中一张并可以将其余牌置于牌堆底，此技能本回合观看牌数-1。",
  anzhi: "暗织",
  anzhi_info:
    "出牌阶段或当你受到伤害后，你可以进行判定，若结果为：红色，重置〖霞泪〗；黑色，你可以令一名非当前回合角色获得本回合进入弃牌堆的两张牌，且此技能本回合失效。",

  tianshangyi: "田尚衣",
  posuo: "婆娑",
  posuo_info:
    "出牌阶段每种花色限一次，若你本阶段未对其他角色造成过伤害，你可以将一张手牌当一张有相同花色对应实体牌的伤害牌使用。",
  xiaoren: "绡刃",
  xiaoren_info:
    "每回合限一次，当你造成伤害后，你可以进行判定，若结果为：红色，你可以令一名角色回复1点体力，然后若其未受伤，其摸一张牌；黑色，你对受伤角色的上家或下家造成1点伤害，若其未因此进入濒死状态，你可以再次进行判定并执行对应效果。",

  huaman: "花鬘",
  manyi: "蛮裔",
  manyi_info: "锁定技，【南蛮入侵】对你无效。",
  mansi_viewas: "蛮嗣",
  mansi: "蛮嗣",
  mansi_info:
    "出牌阶段限一次，你可以将所有手牌当【南蛮入侵】使用；当一名角色受到【南蛮入侵】的伤害后，你摸一张牌。",
  souying: "薮影",
  souying_info:
    "每回合限一次，当你使用牌指定其他角色/其他角色使用牌指定你为唯一目标后（延时锦囊牌除外），若此牌不为使用者本回合对目标角色使用的第一张牌，你可以弃置一张牌，获得此牌/令此牌对你无效。",
  zhanyuan: "战缘",
  zhanyuan_info:
    "觉醒技，准备阶段，若你因〖蛮嗣〗累计获得过至少七张牌，你加1点体力上限并回复1点体力。然后你可以选择一名男性角色，若如此做，你与其获得〖系力〗，然后你失去〖蛮嗣〗。",
  xili: "系力",
  xili_info:
    "每回合限一次，当另一名拥有〖系力〗的角色于其回合内对除你与其外的角色造成伤害时，你可以弃置一张牌，令此伤害+1，然后你与其各摸两张牌。",

  zhugeguo: "诸葛果",
  qirang: "祈禳",
  qirang_info:
    "当你使用装备牌时，你可以连续亮出牌堆顶的牌直到亮出锦囊牌，然后获得此牌。若此牌为普通锦囊牌，你本回合使用此牌可以增加一个目标。",
  yuhua: "羽化",
  yuhua2: "羽化",
  yuhua_info:
    "弃牌阶段开始时，你可以展示任意张非基本牌，令这些牌本阶段不计入手牌上限。结束阶段，若你的手牌数大于体力上限，你可以观看牌堆顶的一张牌并将之置于牌堆顶或牌堆底。",

  dc_ruiji: "芮姬",
  wangyuan: "妄缘",
  wangyuan_info:
    "当你于回合外失去牌后，你可以亮出牌堆顶的两张牌，然后将其中一张与已有“妄”牌名均不同的基本牌或锦囊牌置于你的武将牌上，称为“妄”（至多为游戏人数）。",
  lingyin: "铃音",
  lingyin_info:
    "出牌阶段开始时，你可以获得至多X张“妄”（X为游戏轮数）。若其余的“妄”颜色均相同，你本回合对其他角色造成的伤害+1且可以将武器或防具牌当【决斗】使用。",
  liying: "俐影",
  liying_info:
    "每回合限一次，当你于摸牌阶段外获得牌后，你可以将这些牌交给一名其他角色，然后摸一张牌。若此时为你的回合内，你发动一次〖妄缘〗。",

  re_tianshangyi: "田尚衣",
}

export default translates
