const translates = {
  caozhi: "曹植",
  luoying: "落英",
  luoying_discard: "落英",
  luoying_judge: "落英",
  luoying_judge_noconf: "落英·判定",
  luoying_info:
    "当其他角色的一张梅花牌因弃置或判定而置入弃牌堆后，你可以获得之。",
  jiushi: "酒诗",
  jiushi1: "酒诗",
  jiushi2: "酒诗",
  jiushi3: "酒诗",
  jiushi_info:
    "当你需要使用【酒】时，若你的武将牌正面朝上，你可以翻面，视为使用一张【酒】；当你受到伤害后，若你的武将牌背面朝上且于你受到伤害时背面朝上，你可以翻面。",

  yujin: "于禁",
  zhenjun: "镇军",
  zhenjun_info:
    "出牌阶段开始时，你可以交给一名其他角色一张牌，令其使用一张非黑色的【杀】。若其执行，此【杀】结算结束后，你摸X+1张牌（X为此【杀】造成的伤害值）；若其不执行，你可以对其或其攻击范围内的一名角色造成1点伤害。",

  zhangchunhua: "张春华",
  jueqing: "绝情",
  jueqing_info: "锁定技，你即将造成的伤害视为失去体力。",
  shangshi: "伤逝",
  shangshi_info:
    "当你的手牌数小于X时，你可以将手牌摸至X张（X为你已损失的体力值）。",

  fazheng: "法正",
  enyuan: "恩怨",
  enyuan1: "恩怨",
  enyuan2: "恩怨",
  enyuan_info:
    "当你获得一名其他角色至少两张牌后，你可以令其摸一张牌；当你受到1点伤害后，你可以令伤害来源选择一项：1.交给你一张手牌；2.失去1点体力。",
  xuanhuo: "眩惑",
  xuanhuo_info:
    "摸牌阶段，你可以改为令一名其他角色摸两张牌，然后除非其对其攻击范围内你选择的另一名角色使用一张【杀】，否则你获得其两张牌。",

  masu: "马谡",
  sanyao: "散谣",
  sanyao_info:
    "出牌阶段限一次，你可以弃置一张牌，然后对体力值最大的一名角色造成1点伤害。",
  zhiman: "制蛮",
  zhiman_info:
    "当你对其他角色造成伤害时，你可以防止此伤害，然后获得其装备区或判定区里的一张牌。",

  xushu: "徐庶",
  wuyan: "无言",
  wuyan_info:
    "锁定技，当你使用锦囊牌造成伤害时，或受到锦囊牌造成的伤害时，防止此伤害。",
  jujian: "举荐",
  jujian_info:
    "结束阶段，你可以弃置一张非基本牌并令一名其他角色选择一项：1.摸两张牌；2.回复1点体力；3.复原武将牌。",

  lingtong: "凌统",
  xuanfeng: "旋风",
  xuanfeng_info:
    "当你于弃牌阶段弃置过至少两张牌，或当你失去装备区里的牌后，你可以弃置至多两名其他角色的共计两张牌。",

  wuguotai: "吴国太",
  ganlu: "甘露",
  ganlu_info:
    "出牌阶段限一次，你可以令两名装备区里的牌数之差不大于你已损失的体力值的角色交换装备区里的牌。",
  buyi: "补益",
  buyi_info:
    "当一名角色进入濒死状态时，你可以展示其一张手牌，若此牌不为基本牌，其弃置此牌，然后回复1点体力。",

  xusheng: "徐盛",
  pojun: "破军",
  pojun2: "破军",
  pojun_info:
    "当你于出牌阶段内使用【杀】指定一名角色为目标后，你可以将其至多X张牌（X为其体力值）移出游戏直至回合结束。",

  chengong: "陈宫",
  mingce: "明策",
  mingce_info:
    "出牌阶段限一次，你可以将一张装备牌或【杀】交给一名其他角色，然后其选择一项：1.视为对其攻击范围内你选择的另一名角色使用一张【杀】；2.摸一张牌。",
  zhichi: "智迟",
  zhichi2: "智迟",
  zhichi_info:
    "锁定技，当你于回合外受到伤害后，本回合【杀】和普通锦囊牌对你无效。",

  gaoshun: "高顺",
  xianzhen: "陷阵",
  xianzhen_info:
    "出牌阶段限一次，你可以与一名角色拼点，若你：赢，本阶段你无视其防具、对其使用牌无距离和次数限制；没赢，本阶段你不能使用【杀】。",
  jinjiu: "禁酒",
  jinjiu_info: "锁定技，你的【酒】均视为【杀】。",
}

export default translates
