export default {
  "#luoying1": "这些都是我的。",
  "#luoying2": "别着急扔，给我就好。",
  "#jiushi1": "置酒高殿上，亲友从我游。",
  "#jiushi2": "走马行酒醴，驱车布鱼肉。",
  "#caozhi:die": "本是同根生，相煎何太急。",

  "#zhenjun1": "诸军严整，敌军自乱！",
  "#zhenjun2": "安营驻寨，严守城防！",
  "#yujin:die": "忍辱偷生，无颜以面丞相厚恩……",

  "#jueqing1": "你的死活，与我何干？",
  "#jueqing2": "无来无去，不悔不怨。",
  "#shangshi1": "无情者伤人，有情者自伤。",
  "#shangshi2": "自损八百，可伤敌一千。",
  "#zhangchunhua:die": "怎能如此对我！",

  "#enyuan1": "报之以李，还之以桃。",
  "#enyuan2": "伤了我，休想全身而退！",
  "#xuanhuo1": "收人钱财，替人消灾。",
  "#xuanhuo2": "哼，叫你十倍奉还！",
  "#fazheng:die": "汉室复兴，我，是看不到了……",

  "#sanyao1": "三人成虎，事多有。",
  "#sanyao2": "散谣惑敌，不攻自破！",
  "#zhiman1": "兵法谙熟于心，取胜千里之外！",
  "#zhiman2": "丞相多虑，且看我的！",
  "#masu:die": "败军之罪，万死难赎……",

  "#wuyan1": "汝有良策，何必问我！",
  "#wuyan2": "吾，誓不为汉贼献一策！",
  "#jujian1": "天下大任，望君莫辞！",
  "#jujian2": "卧龙之才，远胜于吾。",
  "#xushu:die": "忠孝不能两全，孩儿……",

  "#xuanfeng1": "伤敌于千里之外！",
  "#xuanfeng2": "索命于须臾之间！",
  "#lingtong:die": "大丈夫不惧死亡……",

  "#ganlu1": "此真乃吾之佳婿也。",
  "#ganlu2": "男婚女嫁，须当交换文定之物。",
  "#buyi1": "吾乃吴国之母，何人敢造次？",
  "#buyi2": "有老身在，汝等尽可放心。",
  "#wuguotai:die": "卿等，务必用心辅佐仲谋……",

  "#pojun1": "大军在此！汝等休想前进一步！",
  "#pojun2": "敬请，养精蓄锐！",
  "#xusheng:die": "盛，不能奋身出命，不亦辱乎……",

  "#mingce1": "如此，一击可擒也。",
  "#mingce2": "如此，霸业可图也。",
  "#zhichi1": "如今之计，唯有退守，再做决断。",
  "#zhichi2": "若吾，早知如此……",
  "#chengong:die": "请出就戮！",

  "#xianzhen1": "攻无不克，战无不胜！",
  "#xianzhen2": "破阵斩将，易如反掌！",
  "#jinjiu1": "避嫌远疑，所以无误。",
  "#jinjiu2": "贬酒阙色，所以无污。",
  "#gaoshun:die": "生死有命……",
}
