const characterIntro = {
  liubei:
    "汉昭烈帝刘备（161年－223年6月10日），字玄德，涿郡涿县（今河北省涿州市大树楼桑村）人，西汉中山靖王刘胜之后，蜀汉开国皇帝、政治家。史家多称其为先主。<br><br>刘备父亲早逝，少年时依靠宗族资助进入洛阳读书，拜卢植为师。成年后招兵买马，与好兄弟关羽、张飞一同组建武装力量，参与镇压黄巾起义、诸侯伐董等重大事件。因为自身家底薄弱，刘备在诸侯混战过程中屡败屡战，早期追随公孙瓒，后投靠徐州陶谦，陶谦因面临曹操严峻威胁而将徐州托付给刘备，虽然刘备得到糜竺、陈登等士族的拥护，但张飞与陶谦旧部曹豹发生冲突，曹豹引吕布夺取徐州，导致刘备势力只剩下小沛。<br><br>后来刘备得到曹操器重，被引见于汉献帝，受左将军之职。然而国舅董承以献帝衣带诏名义要刘备诛曹操，刘备自认受曹操怀疑而借东征名义叛离，投奔袁绍。后又投靠刘表，在荆州过上了相对安稳的生活，三顾茅庐请到诸葛亮，并生下儿子刘禅。刘表之子刘琮投降曹操后，刘备虽得到大量刘表旧部和士人、民众归附，但不忍背叛族亲，只是率众投奔刘琦，但在长坂被曹军追上并击溃，仅以数十骑幸免。与刘琦合流后在鲁肃介绍下依附孙权。<br><br>孙刘联军在赤壁大破曹军，之后刘备与周瑜攻打南郡，最终拿下荆州大半。又在应刘璋邀请入川后背叛并夺取益州，又夺取巴西、汉中、上庸，为日后蜀汉政权奠基。而后关羽被东吴所害，同年刘备在献帝禅代后称帝，自称继承汉统。之后刘备不听群臣劝阻，执意发大军攻打吴国，结果兵败夷陵，蜀汉大军损失殆尽，不得不退回白帝城。之后再未回到成都，于章武三年（223年）病逝，将刘禅托付给诸葛亮和李严，终年六十三岁，谥号昭烈皇帝，《晋书·王弥传》称之为烈祖，葬惠陵。<br><br>刘备弘毅宽厚、知人待士、百折不挠，在乱世白手起家，转战大半个震旦之地，成为鼎立三足其一，堪称汉末最传奇的枭雄。其临死前举国托付给诸葛亮的行为被陈寿赞为“古今之盛轨”。后世众多文艺作品以刘备为主角。成都武侯祠有汉昭烈庙为之纪念。<br><br>《三国演义》中刘备是主角之一，其“仁德”的一面被无限夸大。",
  guanyu:
    "关羽（？—220年），本字长生，后改字云长，河东郡解县（今山西运城）人，雅号“美髯公”。早年跟随刘备颠沛流离，转战各地，和刘备、张飞情同兄弟。曾被曹操军俘获并投降，虽然受到厚待，不仅历任偏将军、前将军，还因白马之战阵斩颜良之功被曹操表为汉寿亭侯，但关羽认为已报答曹操恩德，封存赏赐，离开曹操去追随刘备，曹操感其忠义而命令部下不得阻拦。赤壁之战后，关羽助刘备、周瑜攻打曹仁所驻守的南郡，而后刘备势力逐渐壮大，关羽则长期镇守荆州，与东吴多有摩擦，孙权、吕蒙虽遭轻慢却假意殷勤，但已有消灭关羽、全据荆州之心。<br><br>建安二十四年，关羽在与曹仁之间的军事摩擦中逐渐占据上风，随后水陆并进，围襄阳，攻樊城，并借助秋季大雨水淹于禁、庞德援军之机乘船猛攻，生擒一众将领，进而包围樊城，“威震华夏”，使得曹操一度产生迁都以避关羽锋锐的想法。<br><br>但随后东吴孙权派遣吕蒙、陆逊袭击了关羽的后方，荆州守将麋芳、傅士仁投降。同时，关羽又在与徐晃的交战中失利，最终进退失据，被吴军擒杀，首级被送给曹操，以诸侯之礼下葬。蜀汉后主刘禅时期被追谥曰“壮缪侯”。<br><br>关羽去世后，逐渐被神化，民间尊其为“关公”；历代朝廷多有褒封，“侯而王，王而帝，帝而圣，圣而天”；被崇为“武圣”，与“文圣” 孔子齐名。《三国演义》尊其为蜀国“五虎上将”之首，毛宗岗称其为《演义》三绝中的“义绝”。",
  zhangfei:
    "张飞（？—221年），字益德（一作“翼德”），涿郡（今河北保定涿州市）人，三国时期蜀汉名将。张飞勇武过人，与关羽并称为“万人敌”。关羽年长数岁，张飞兄事之。公元184年黄巾起义爆发，刘备在涿县组织起了一支义勇军参与扑灭黄巾军的战争，张飞与关羽一起加入，随刘备辗转各地。三人情同兄弟，寝则同床，刘备出席各种宴会时，和关羽终日侍立在刘备身旁。公元196年因交恶曹豹而被吕布所破。吕布败亡之后，张飞被任命为中郎将。公元200年刘备衣带诏事情泄漏，率领关羽、张飞逃走，杀徐州刺史车胄。后刘备战败，关羽被擒，刘备与张飞投奔袁绍。公元208年刘备于长坂坡败退时，张飞仅率二十骑断后，据当阳桥厉声大喝，曹军无人敢逼近，刘备因此得以免难。<br><br>刘备入蜀后，张飞与诸葛亮、赵云进军西川，分定郡县。在抵达江州时义释了刘璋手下的巴郡太守严颜。在巴西之战中，击败魏国名将张郃。在武都之战中，兵败而还。刘备称帝后，张飞晋升为车骑将军、领司隶校尉，封西乡侯。同年，张飞因为暴而无恩，被部将范强、张达杀害。谥曰桓侯。<br><br>在《三国杀》中，神张飞是第一个有隐藏台词的武将。",
  zhugeliang:
    "诸葛亮（181年—234年10月8日），字孔明，号卧龙，琅琊阳都（今山东省沂南县）人，三国时期蜀汉丞相，中国历史上杰出的政治家、军事家、文学家、书法家、发明家。<br><br>早年随叔父诸葛玄到荆州，诸葛玄死后，诸葛亮就在隆中隐居。后刘备三顾茅庐请出诸葛亮，联合东吴孙权于赤壁之战大败曹军。形成三国鼎足之势，又夺占荆州。建安十六年（211年），攻取益州。继又击败曹军，夺得汉中。蜀章武元年（221年），刘备在成都建立蜀汉政权，诸葛亮被任命为丞相，主持朝政。后主刘禅继位，诸葛亮被封为武乡侯，领益州牧。勤勉谨慎，大小政事必亲自处理，赏罚严明；与东吴联盟，改善和西南各族的关系；实行屯田政策，加强战备。前后五次北伐中原，多以粮尽无功。终因积劳成疾，于蜀建兴十二年（234年）病逝于五丈原，享年54岁。刘禅追封其为忠武侯，后世常以武侯尊称诸葛亮。东晋政权因其军事才能特追封他为武兴王。<br><br>诸葛亮散文代表作有《出师表》《诫子书》等。曾发明木牛流马、孔明灯等，并改造连弩，叫做诸葛连弩，可一弩十矢俱发。诸葛亮一生“鞠躬尽瘁、死而后已”，是中国传统文化中忠臣与智者的代表人物。<br><br>诸葛亮在三国杀中是现存版本最多的武将。蜀中无大将，尽是诸葛亮。",
  zhaoyun:
    "赵云（？－229年），字子龙，常山真定人。身长八尺，姿颜雄伟，汉末三国时期蜀汉名将，与关羽、张飞并称“燕南三士”。<br><br>汉末军阀混战，赵云受本郡推举，率领义从加入公孙瓒。期间结识了汉室皇亲刘备，但不久之后，赵云因为兄长去世而离开。赵云离开公孙瓒大约七年后，在邺城与刘备相见，从此追随刘备。<br><br>赵云跟随刘备将近三十年，先后参加过博望坡之战、长坂坡之战、江南平定战，独自指挥过入川之战、汉水之战、箕谷之战，都取得了非常好的战果。除了四处征战，赵云还先后以偏将军任桂阳太守，以留营司马留守公安，以翊军将军督江州。除此之外，赵云于平定益州时引霍去病故事劝谏刘备将田宅归还百姓，又于关羽、张飞被害之后劝谏刘备不要伐吴，被后世赞为有大臣局量的儒将，甚至被认为是三国时期的完美人物。<br><br>赵云去世后，于景耀四年（261年）被追谥为“顺平侯”，其“常胜将军”的形象在后世被广为流传。<br><br>按照三国杀的剧情故事，赵云早年娶了马超之妹马云騄，并生下一女赵襄。后于长坂大战后阻挡追兵时与刘备失散，遇到李翠莲，二人一见钟情，与其成婚后，赵云出发回到队伍，李翠莲在等待赵云归来期间生下全定。后于桂阳遇到赵范，赵范想赵云娶了自己的嫂子樊玉凤，但被赵云拒绝。然后在刘备前往东吴和亲期间遇到周夷一见钟情，刘备不许。后来在没过多久就在断肠崖被周夷打吃瘪了，但对方放走他之后便暴病而亡，然后这个断肠崖便改名为夷陵。全定成年，与李翠莲带着青釭剑去认父亲，谁知赵云正与诸葛亮打赌，为了不输掉这个赌赵云不认这两母子，后来全定斩将立功，在诸葛亮与众将的劝说下，终于赵云夫妻相认，父子团圆。最后老年在凤鸣山被曹婴所击败，真是命中注定犯桃花劫，多灾多难的一生，甚至花关索见了都要叫一声大哥。赵统和赵广的生母还是个迷。",
  machao:
    "马超（176年～222年），字孟起，扶风茂陵人，马腾之子，汉伏波将军马援的后人。汉末三国时期蜀汉名将。<br><br>马超少有健名，曹操曾多次征召马超入京为官，但都被马超拒绝。而后其父马腾入京被封为卫尉，马超就统领了马腾的部队。<br><br>建安十六年（211年），曹操治兵关中，马超联合关中诸侯韩遂等抵抗曹操，曾一度对曹操造成了极大的威胁，但被曹操用离间计击败退走，而后聚拢部队再次攻取陇上诸郡，失败后依附汉中张鲁。刘备攻打刘璋时，马超投降刘备，与刘备军合围成都，汉中之战后联名上书尊刘备为汉中王。章武元年（221年），刘备称帝建立蜀汉后，马超官至骠骑将军，领凉州牧，进封斄乡侯。<br><br>章武二年（222年），马超病逝，享年四十七岁，死后由其子马承嗣爵斄乡侯。马超之女配安平王刘理为妻。刘禅时期被追谥为威侯。有剑术“出手法”流传后世。<br><br>《三国演义》里的马超被称为“锦马超”，羌人将其奉为“神威天将军”；曾在潼关将曹操杀得割须弃袍。",
  huangyueying:
    "黄月英，荆州沔南白水人，沔阳名士黄承彦之女，诸葛亮之妻，诸葛瞻之母。容貌甚丑，而有奇才：上通天文，下察地理，韬略近于诸书无所不晓，诸葛亮在南阳闻其贤而迎娶。",

  sunquan:
    "吴大帝孙权（182年－252年5月21日），字仲谋。吴郡富春县（今浙江省杭州市富阳区）人。三国时期孙吴的建立者（229年－252年5月21日在位）。<br><br>孙权的父亲孙坚和兄长孙策，在东汉末年群雄割据中打下了江东基业。建安五年（200年），孙策遇刺身亡，孙权继之掌事，成为一方诸侯。建安十三年（208年），与刘备建立孙刘联盟，并于赤壁之战中击败曹操，奠定三国鼎立的基础。建安二十四年（219年），派吕蒙成功袭取刘备的荆州，使领土面积大大增加。<br><br>魏篡汉后，孙权一度接受魏庭册封“大魏吴王”称号的来历。黄武元年（222年），孙权自称吴王，建立吴国。同年，在夷陵之战中大败刘备。黄龙元年（229年），在武昌正式称帝，国号吴，不久后迁都建业。孙权称帝后，设置农官，实行屯田，设置郡县，并继续剿抚山越，促进了江南经济的发展。黄龙二年（230年），所派将军卫温、诸葛直抵达夷州（今台湾）。<br><br>孙权晚年在继承人问题上反复无常，引致群下党争，朝局不稳，史称“二宫之争”或“南鲁党争”。于神凤元年（252年）病逝，享年七十一岁，在位二十四年，谥号大皇帝，庙号太祖，葬于蒋陵。",
  ganning:
    "甘宁（？—215年？220年？存疑），字兴霸，巴郡临江（今重庆忠县）人，三国时期孙吴名将，官至西陵太守，折冲将军。少年时好游侠，纠集人马，持弓弩，在地方上为非作歹，组成渠师抢夺船只财物，崇尚奢华，人称锦帆贼。率百余人夜袭曹营，斩得数十首级而回。初服从于黄祖，但是最后却投靠了孙权。他保护孙权蹴马趋津，死里逃生。甘宁虽然粗野凶狠，暴躁嗜杀，甚至违反承诺、违抗命令，但是，开朗豪爽，有勇有谋，轻视钱财，敬重士人，厚待士卒，并深得士卒拥戴。陈寿在史书中将他列为“江表之虎臣”。",
  lvmeng:
    "吕蒙（178年—220年），字子明，汝南富陂（今安徽省阜南东南）人，中国东汉末年孙权的谋士与将领。<br><br>吕蒙少年时依附姊夫邓当，随孙策为将，以胆气称。邓当死后，吕蒙统领其部众，拜别部司马，治军有方、士卒操练娴熟，得到宠任。建安十三年（208年），从孙权征灭刘表将领黄祖，升横野中郎将。是年，又随周瑜、程普大破曹操于赤壁。建安十九年（214年），跟从孙权征皖城（今安徽潜山），功劳最大，拜庐江太守。翌年，奉命西取长沙、零陵等地。后升左护军、虎威将军。鲁肃卒后，吕蒙代督其军，屯于陆口，与关羽为邻。<br><br>建安二十四年（219年），孙权采吕蒙计，令其称病还建业，由威名未著的陆逊代守陆口，以此麻痹关羽，使其不以吴军为患，调大军北攻曹军。吕蒙则乘其后方空虚之际，率精兵攻取南郡。入城后军纪严明，抚恤老病，优遇关羽将士家属，瓦解了关羽部众斗志，从而斩关羽，定荆州。升南郡太守，封孱陵侯。<br><br>建安二十四年（219年）的年末（220年初），因病去世，享年四十二岁。在小说《三国演义》中则是被关羽阴魂索命后倒地而亡。<br><br>吕蒙是东吴攻灭关羽的最早倡议者。吕蒙针对于关羽所督的荆州，215年夺取三郡，219年再夺三郡，最终使得东吴国土面积大增，实现了“全据长江”的宿愿。其发愤勤学的事迹，成为中国古代将勤补拙、笃志力学的代表，相关典故“士别三日”、“刮目相待”、“吴下阿蒙”等。",
  huanggai:
    "黄盖（生卒年不详），字公覆，零陵泉陵（今湖南省永州市零陵区）人。东汉末年名将，历仕孙坚、孙策、孙权三主，为人严肃，善于训练士卒，每每征讨，他的部队皆勇猛善战。<br><br>建安十三年（208年）赤壁之战时，黄盖向大都督周瑜提出火攻之计，借助风势以火船急袭大破曹操军队，是赤壁之战主要功臣之一，以功拜武锋中郎将，他也因为此事迹而被后人广为传颂。《三国演义》改为周瑜和诸葛亮想出火计，而黄盖向周瑜提出“苦肉计”，向曹军诈降从而令曹军对火计没有防备。<br><br>不久武陵蛮夷反，攻打城邑，黄盖以五百人，放其半入，拦腰截击，大破诸贼。春去夏来，寇乱尽平。后又平讨长沙益阳县山贼，加偏将军。官至偏将军、武陵太守。估计夷陵之战前去世。",
  zhouyu:
    "周瑜（公元175年－公元210年），字公瑾，汉末名将，庐江舒县（今安徽省庐江县西南）人。洛阳令周异之子，长壮有姿貌、精音律，江东有“曲有误，周郎顾”之语。<br><br>周瑜少与孙策交好，曾拒绝袁术的招募。21岁起追随孙策奔赴战场平定江东，后孙策遇刺身亡，孙权继任，周瑜将兵赴丧，以中护军的身份与长史张昭共掌众事，并举荐鲁肃。<br><br>公元208年（建安十三年），曹军大举南下，号称八十万大军。周瑜任大都督，力排众议，又拒绝了旧友蒋干的游说，坚决主张与曹操决战，率江东孙氏集团军队与刘备军队联合。周瑜击败荆州水军，又用黄盖火船急袭之计，在赤壁大败曹军，由此奠定了三分天下的基础。之后继续攻打曹仁驻守的南郡，公元209年（建安十四年）夺取江陵，领南郡太守。公元210年（建安十五年）病逝，年仅36岁。<br><br>周瑜与孙氏麾下老将程普长期不合，孙权亦长期以程普为周瑜之副，制衡其权力。周瑜屡遭轻侮，但不以为意。后来程普对周瑜改观，称：“与周公瑾交，若饮醇醪，不觉自醉”。<br><br>周瑜与刘备相忌，一早就看出刘备不会久居人下，建议孙权将其软禁在建业后迫使关羽、张飞为己军作战。<br><br>正史中周瑜文武兼备，“性度恢廓”“实奇才也”，一生致力于为主公夺取天下。范成大誉之为“江左风流美丈夫”。<br><br>《三国演义》中将周瑜塑造成了一个善妒的小人形象，视诸葛亮为宿敌，连续三次算计诸葛亮失败，反被气死。央视旧版《三国演义》中的周瑜则是史实性格+演义经历的结合体。",
  daqiao:
    "大乔（生卒年不详），庐江郡皖县人（今安徽安庆潜山），东汉末年江东孙策的夫人，本姓“桥”，小说《三国演义》误作“乔”，因为同时还有一个妹妹嫁给周瑜，为了进行区分，姐姐习惯称作“大乔（桥）”。",
  luxun:
    "陆逊（183年－245年3月19日），本名陆议，字伯言，吴郡吴县（今江苏苏州）人。三国时期吴国政治家、军事家。建安八年（203年）入孙权幕府，历任海昌屯田都尉、定威校尉、帐下右部督。因受孙权赏识得以发挥卓越的军事才能，地位渐至隆崇。建安二十四年（219年），陆逊参与袭取荆州。蜀章武二年（222年），孙权以陆逊为大都督，在夷陵之战中火烧连营击败刘备。吴黄武七年（228年），陆逊取得石亭之战的胜利。后因支持太子孙和与孙权发生矛盾。次年去世，终年六十三岁，追谥“昭”。",
  sunshangxiang:
    "孙夫人，乃孙权之妹。刘备定荆州，孙权进妹与其结姻，重固盟好。孙夫人才捷刚猛，有诸兄之风。后人为其立庙，号曰“枭姬庙”。<br><br>孙夫人的名讳于正史无载，民间戏剧中广泛作“孙尚香”，戏曲《隔江斗智》作“孙安”（周善技能取材于此），《三国演义》作“孙仁”。而《三国杀》使用的称号“弓腰姬”则是吉川英治《三国志》中孙夫人的称号。<br><br>在《三国杀》中，她是第一个双重势力的武将。",

  caocao:
    "魏武帝曹操（155年～220年3月15日），字孟德，小名阿瞒、吉利，沛国谯县（今安徽省亳州市）人。中国古代杰出的政治家、军事家、文学家、书法家、诗人。东汉末年权相，太尉曹嵩之子，曹魏的奠基者。<br><br>东汉末年，面对天下大乱，以汉献帝刘协名义征讨四方，对内消灭袁绍、袁术、吕布、刘表、马超、韩遂等割据势力，对外降服南匈奴、乌桓、鲜卑等，统一中国北方地区，扩大屯田、兴修水利、奖励农桑、重视手工业、安置流民、实行“租调制”，促进中原地区经济生产和社会稳定。建安十八年，获封魏公，建立魏国，定都邺城。建安二十一年，册封魏王，权位在诸王之上。<br><br>建安二十五年（220年3月15日），曹操去世，谥号为武，安葬于高陵。其子曹丕称帝，追封皇帝，谥号为武，庙号太祖。",
  simayi:
    "司马懿（179年～251年9月7日），字仲达，河内郡温县孝敬里（今河南省温县）人，三国时期魏国权臣、政治家、军事家、战略家，西晋王朝的奠基人。<br><br>司马懿自幼聪明多大略，博学洽闻，伏膺儒教。因汉室被曹氏所控制，司马懿一度拒绝曹操授予的官职，但建安十三年（208年），曹操任丞相后，强行辟司马懿为文学掾。逐渐赢得了曹操的信任。曹操封魏王后，以司马懿为太子中庶子以佐助曹丕，帮助曹丕在储位之争中获得胜利。曹丕临终时，令司马懿与曹真等为辅政大臣，辅佐魏明帝曹叡。明帝时，司马懿屡迁抚军大将军、大将军、太尉等重职。明帝崩，托孤幼帝曹芳于司马懿和曹爽。曹芳继位后，司马懿遭到曹爽排挤，升官为无实权的太傅。正始十年（249年），司马懿趁曹爽陪曹芳离洛阳至高平陵祭陵，起兵政变并控制京都洛阳。自此，曹魏的军政权力落入司马氏手中，史称高平陵事变。司马懿善谋奇策，多次征伐有功，曾率军擒斩孟达，两次率大军成功抵御诸葛亮北伐，远征平定辽东。对屯田、水利等农耕经济发展有重要贡献。<br><br>嘉平三年八月戊寅日（251年9月7日），司马懿病逝，享年七十三岁，辞郡公和殊礼，葬于首阳山，谥号文贞，后改为文宣。次子司马昭封晋王后，追谥司马懿为宣王；其孙司马炎称帝后，追尊司马懿为宣皇帝，庙号高祖。",
  xiahoudun:
    "夏侯惇（？－220年6月13日），字元让，沛国谯县（今安徽亳州）人。汉末三国时期曹魏名将，西汉开国元勋夏侯婴的后代。少年时以勇气闻名于乡里。曹操起兵，夏侯惇是其最早的将领之一。与吕布军交战时，曾一度被擒为人质，又被流矢射瞎左眼（演义中被曹性暗算，正史应是乱军中箭）。多次为曹操镇守后方，曾率军民阻断太寿河水，筑陂塘灌溉农田，使百姓受益，功勋卓著。历任折冲校尉、济阴太守、建武将军，官至大将军，封高安乡侯，追谥忠侯。青龙元年（233年），得以配享太祖（曹操）庙庭。夏侯惇一生虽多在军旅，但仍不忘治学。他常亲自迎师，虚心求教。他为人俭朴，所得赏赐全部分给将士。一生不置产业，至死家无余财。",
  zhangliao:
    "张辽（169年-222年），字文远，雁门马邑（今山西朔州）人，聂壹的后人，三国时期曹魏名将。<br><br>张辽年少时为雁门郡吏，中平五年（188年），被并州刺史丁原召为从事。入京后，先后隶属于何进、董卓、吕布，为骑都尉。兴平元年（194年），从吕布攻曹操于兖州。后与吕布奔徐州，领鲁相。吕布败亡后，张辽率众降曹操，任中郎将。建安五年（200年），在官渡之战中，数有战功。战后，奉命平鲁国诸县，又收降地方豪强昌豨于东海。从征冀州有功，行中坚将军。又独领一军攻占赵国、常山以及海滨地带，升荡寇将军。建安十二年（207年），随曹操征柳城。于白狼山之战率领先锋大破乌桓，并斩杀乌桓单于蹋顿。次年，以静制动平定军中谋反。次年，击灭江淮军阀陈兰、梅成。后进驻合肥。<br><br>建安二十年（215年），合肥之战，张辽率领八百将士，袭击东吴十万大军，一直冲杀到孙权的主帅旗下，令东吴军队皆披靡。在东吴撤军时，张辽率领追兵，大破孙权、甘宁、凌统等，差点活捉孙权。经此一役，张辽威震江东。 “张辽止啼”成为流传千古的典故。战后，升征东将军。曹丕即位后，转为前将军，受封晋阳侯。黄初三年（222年），带病率军攻吴，破吴将吕范。不久病卒于江都（今江苏扬州西南），谥曰刚侯。张辽为历代所推崇，成为古今六十四名将之一。",
  xuzhu:
    "许褚（生卒年不详），字仲康，谯国谯县（今安徽省亳州市谯城区）人。三国时曹魏将领。<br><br>许褚早年聚集当地青年和宗族几千家，筑壁垒抵抗贼寇。献帝建安元年（196年），许褚率部众归顺曹操，任都尉。其后，跟随曹操讨伐张绣，率领宿卫虎士作为先登，杀敌无数，官拜校尉。官渡之战中，徐他等人阴谋反叛，被许褚觉察杀死，曹操对许褚更加信任。后许褚随曹操包围邺城，奋力战斗，赐关内侯。<br><br>建安十六年（211年），讨伐韩遂、马超渡黄河时，许褚拼死护卫曹操，勉强渡到对岸。两军开战后，曹军击溃马超，许褚任武卫中郎将。许褚力大如虎，但并不聪明，因此军中称其“虎痴”。但其谨慎守法，沉默寡言，深得曹操爱惜，后升中坚将军。黄初元年（220年），曹操去世，许褚痛哭吐血。曹丕即位后，封许褚为万年亭侯，升武卫将军，总督中军宿卫禁兵。魏明帝即位后，封牟乡侯，食邑七百户，赐一子关内侯。",
  guojia:
    "郭嘉（170年－207年），字奉孝，颍川阳翟（今河南禹州）人。东汉末年曹操帐下著名谋士。<br><br>郭嘉出身颍川郭氏。原为袁绍部下，后转投曹操，为曹操统一中国北方立下了功勋，官至军师祭酒，封洧阳亭侯。在曹操征伐乌丸时病逝，年仅三十八岁。谥号贞侯。史书上称他“才策谋略，世之奇士”。曹操称赞他见识过人，是自己的“奇佐”。",
  zhenji:
    "文昭甄皇后（183年1月26日—221年8月4日），名不明，相传为甄宓 ，实则无记载。史称甄夫人，中山郡无极县（今河北无极）人，上蔡令甄逸之女。魏文帝曹丕的妻子，魏明帝曹叡的生母。<br><br>甄氏三岁丧父。建安中期，袁绍次子袁熙娶之为妻。建安四年（199年）袁熙出任幽州刺史，甄氏留在冀州侍奉袁绍的妻子刘氏。建安九年（204年），曹操率军攻下邺城，甄氏因为姿貌绝伦，被曹丕所纳，甚得宠爱，生下儿子曹叡和女儿曹氏（即东乡公主）。延康元年（220年），曹丕继位魏王，六月率军南征，甄氏被留在邺城。黄初元年（220年），曹丕称帝，山阳公刘协进献二女为曹丕妃嫔，后宫中文德郭皇后，李贵人和阴贵人都得到宠幸，甄氏愈发失意，流露出一些怨恨的话语，曹丕大怒，黄初二年（221年）六月，遣使赐死甄氏，葬于邺城。<br><br>曹叡即位后，追谥甄氏曰文昭皇后。太和四年十二月辛未日（231年2月17日），魏明帝曹叡将甄氏改葬于朝阳陵。",

  huatuo:
    "华佗（约公元145年－公元208年），字元化，一名旉，沛国谯县（今安徽亳州）人，东汉末年著名的医学家，被后人称为“外科圣手”、“外科鼻祖”、“神医”。<br><br>华佗与董奉、张仲景并称为“建安三神医”。少时曾在外游学，行医足迹遍及安徽、河南、山东、江苏等地，钻研医术而不求仕途。中国外科手术之祖，也是世界上第一位发明麻醉剂“麻沸散”的医者。同时也精通内、妇、儿、针灸各科，是发明用针灸医病的先驱者、创始人。晚年因遭曹操怀疑，下狱被拷问致死，著作《青囊书》也佚失。<br><br>关羽刮骨疗毒是为人津津乐道的典故，《三国演义》将医生改编为华佗。",
  lvbu: "吕布（？～199年2月7日），字奉先，并州五原郡九原县人。东汉末年群雄之一，以勇武闻名，号称“飞将”，时有“人中吕布，马中赤兔”之说。<br><br>吕布因为骁武被并州刺史丁原授骑都尉、河内主簿等职（演义中是丁原的义子）。大将军何进召天下兵马进京后，吕布受董卓收买而杀死丁原，令董卓兼并并州军，后成为董卓的义子，授中郎将。董卓迁都后以吕布为侍卫，但又把吕布当出气筒，甚至曾向吕布掷戟，加之吕布害怕与董卓的婢女私通之事泄露，于是在司徒王允笼络下（演义改为王允用貂蝉施离间计令吕、董二人失和），诛杀董卓，因功迁奋武将军、开府仪同三司，进封温县侯。然而王允不听吕布劝阻，欲将董卓旧部治罪，致使残党反扑长安，吕布不敌，带兵逃离长安开始游荡，沿途抄掠。先投袁术，被袁术拒绝。改投袁绍，协助袁绍大破黑山军，但被袁绍猜忌，遭暗杀未遂。于是去依附张杨。<br><br>兴平元年（194年），吕布趁曹操攻打陶谦时与陈宫等联络而进入兖州，占据濮阳，与曹操血战两年，曾使曹操数战不利，但最终被曹操击败转而去依附徐州刘备。又趁刘备与袁术作战时袭取了徐州，与刘备、袁术时而和好，时而相互攻伐。期间，以辕门射戟化解刘备与纪灵的争斗。<br><br>建安三年（198年），吕布遣将击败刘备与夏侯惇后，曹操亲自出马征讨吕布，水淹下邳。吕布不听陈宫两面互补之计，选择在城中固守求援。最终，吕布部众军心涣散，陈宫、高顺被叛徒擒住，吕布于十二月癸酉投降被俘。吕布提出为曹操效力，但曹操听从刘备、王必等人建议而将吕布处死。",
  diaochan:
    "貂蝉，甘肃临洮人，是民间传说古代四大美女之一的“闭月”。貂蝉的生活年代约在东汉末年，出生年月均不可考。貂蝉的事迹大多出现在说书话本的故事当中，最后由《三国演义》作者罗贯中整理创作出一个完整的形象。<br><br>民间传说中，貂蝉为东汉末年司徒王允家的义女，为拯救汉朝，由王允授意施行连环计，使董卓、吕布两人反目成仇，最终借吕布之手除掉了恶贼董卓。之后貂蝉成为吕布的妾，董卓部将李傕击败吕布后，她随吕布来到徐州。下邳一役后，吕布被曹操所杀，貂蝉跟随吕布家眷前往许昌，从此不知所踪。",

  huaxiong:
    "华雄（？－191），东汉末年董卓部下的武将，为董卓帐下都督。<br><br>公元191年，关东军阀联合讨伐董卓，董卓派大将胡轸统率华雄等进攻时任长沙太守的孙坚，结果被孙坚大败，华雄在此战中被孙坚枭首。<br><br>在小说《三国演义》中，面对十八路诸侯讨伐董卓，华雄主动请战，先斩杀了急于争功而擅自进兵的鲍忠，而后趁孙坚军缺少粮草时夜袭营寨，斩杀了掩护孙坚走小道的部将祖茂；后前往汜水关搦战，先后斩杀了前来应战的俞涉、潘凤，最后被关羽斩首。",

  gongsunzan:
    "公孙瓒（？—199年），字伯圭，辽西令支（今河北迁安）人，东汉末年武将、军阀，汉末群雄之一。公孙瓒出身贵族。因母地位卑贱，只当了郡中小吏。因其相貌俊美，且声音洪亮、机智善辩，得到涿郡太守赏识，将女儿许配给他。受岳父帮助曾与刘备和刘德然共同师事于卢植。公孙瓒好战，与主张以怀柔政策对待胡人的上司刘虞不和，二人矛盾逐渐激化。初平四年（193年），公孙瓒击杀刘虞，并挟持朝廷使者，得到了总督北方四州的授权，成为北方最强大的诸侯之一。他与袁绍多次相争，初期占据优势，但在龙凑之战后，公孙瓒锐气顿减，采取自保战略，逐渐失去了部下信任，被袁绍击败。最终困于高楼，引火自焚。",

  panfeng:
    "潘凤，是罗贯中的小说《三国演义》中的人物，擅使大斧。登场于小说第五回。冀州牧韩馥部下的上将。当十八路诸侯讨伐董卓之时，他奉韩馥之命前往汜水关前挑战董卓部下大将华雄，不及一百回合被斩。",
  yuejin:
    "乐进（？－218年），字文谦，阳平郡卫国（今河南清丰）人。以胆识英烈而从曹操，南征北讨。从击袁绍于官渡，奋勇力战，斩袁绍部将淳于琼。曹操自合肥还，留下乐进与张辽、李典屯于合肥。后来，以乐进数有军功，迁右将军。建安二十三年（218年）逝世，谥曰威侯。",

  kongrong:
    "孔融（153年－208年9月26日），字文举。鲁国（今山东曲阜）人。太山都尉孔宙之子。孔融少有异才，勤奋好学，与平原陶丘洪、陈留边让并称。汉献帝即位后，任北军中侯、虎贲中郎将、北海相，时称孔北海。建安元年（196年），袁谭攻北海，孔融与其激战数月，最终败逃山东。不久，被朝廷征为将作大匠，迁少府，又任太中大夫。性好宾客，喜抨议时政，言辞激烈，后因触怒曹操而被杀。",
}

export default characterIntro
