const characterIntro = {
  old_yuanshu:
    "袁术（？－199年），字公路，汝南汝阳（今河南商水西南）人，司空袁逢之嫡次子，袁绍之从弟。少有侠气，进入仕途后逐步升为虎贲中郎将，与袁绍一同依附大将军何进，是诛杀十常侍的主要参与者之一。董卓进京后，以袁术为后将军，袁术因畏祸而出奔南阳，南阳太守为孙坚所杀，于是袁术被刘表表为南阳太守，并接受孙坚归附。初平元年（190年）与袁绍、曹操等同时起兵，共讨董卓，支援孙坚击破董卓军逼近洛阳，在得知孙坚私藏传国玉玺后将其夺取（演义中是后来孙策进献以换取兵权）。后与袁绍对立，孙坚在攻刘表时阵亡，袁术在袁绍、曹操、刘表的夹攻下战败，率众奔九江，割据扬州，并利用孙坚之子孙策去攻打九江、庐江等地。<br><br>建安二年（197年）袁术称帝，建号仲氏，但未被普遍承认，与吕布结亲遭拒，孙策也借机叛离。此后袁术奢侈荒淫，横征暴敛，使江淮地区残破不堪，民多饥死，部众离心，先后为吕布、曹操所破，元气大伤，不得不尝试投靠袁绍，却被曹操阻住。后于建安四年（199年）呕血而死。",
  ganfuren:
    "甘夫人，沛国（今安徽淮北）人，三国时期蜀汉昭烈帝刘备之妾，蜀汉后主刘禅的生母。<br><br>甘夫人随刘备到荆州时，生刘禅，后来去世，葬于南郡。刘备称帝后，追谥亡妾甘氏为“皇思夫人”。刘禅即位后追谥生母甘夫人为“昭烈皇后”。<br><br>技能名〖神智〗出自东晋时期王嘉的小说集《拾遗记》：河南献玉人高三尺，乃取玉人置后侧，昼则讲说军谋，夕则拥后而玩玉人。常称玉之所贵，德比君子，况为人形而不可玩乎。后与玉人洁白齐润，观者殆相乱惑。嬖宠者非惟嫉于甘后，亦妒于玉人也。后常欲琢毁坏之，乃诫先主曰：“昔子罕不以玉为宝，《春秋》美之。今吴、魏未灭，安以妖玩继怀？凡淫惑生疑，勿复进焉。”先主乃撤玉人像，嬖者皆退。当斯之时，君子议以甘后为神智妇人焉。不过甘夫人死的时候还没有魏吴。欢乐杀据此典故魔改出了活动武将吞星梦狸",

  lidian:
    "李典（生卒年不详），字曼成。山阳郡钜野县（今山东巨野）人。<br><br>李典年少时好学，不爱好征战，于是拜师读《春秋左氏传》，熟读各种书籍。建安十九年（214年）十月，曹操自合肥还，李典与张辽、乐进在合肥驻扎。建安二十年（215年）八月，孙权指挥十万大军围攻合肥，张辽打算按照教谕与李典一同出城交战。乐进、李典、张辽平常都互不和睦。张辽担心李典不从，李典慷慨的说：“这是国家大事，要看你的计策是否好，（如果可行）我怎么能够因为私怨而不顾大局呢！”于是，率领部众与张辽一起打败赶走了孙权。<br><br>李典爱好学问，注重儒雅，从来不和别的将领争抢功劳。尊敬贤士大夫，恐怕有礼节不周的地方，军营的官兵都认为他是长者。三十六岁时去世。",
  xushu:
    "徐庶，字元直。颍川郡长社县（今河南许昌长葛东）人。东汉末年刘备帐下谋士，后归曹操，病逝于曹魏。<br><br>徐庶本名徐福不是这个徐福，为寒门子弟。早年为人报仇，获救后改名徐庶，拜师求道。后与同郡石韬（字广元，与徐庶同期的一名谋士，与徐庶交好）避难于荆州，与司马徽、诸葛亮、崔州平等道友来往密切。刘备屯驻新野时，徐庶前往投奔，并向刘备推荐诸葛亮。徐庶南下时因母亲被曹操所掳获，徐庶不得已辞别刘备，进入曹营。后来此事被艺术加工为“徐庶进曹营，一言不发”等歇后语，被广为流传。而徐庶也成为孝子的典范被加以称赞。魏文帝时，徐庶官至右中郎将、御史中丞。在诸葛亮北伐行军至陇右（今陕甘边界六盘山西部地区）之时听见徐庶与石韬在曹魏不被重用的消息时曾感叹道：“魏殊多士邪！何彼二人不见用乎？（魏国谋士这么多吗？为什么不重用徐庶石韬二人呢？）”",
}

export default characterIntro
