const characterIntro = {
  xuelingyun:
    "薛灵芸，东晋王嘉志怪小说《拾遗记》中的人物，魏文帝曹丕的宫人，妙于针工，虽处于深帷之内，不用灯烛之光，裁制立成。凡不是薛灵芸缝制的衣服，文帝一概不穿，宫中号为针神。<br><br>薛灵芸的故事在正史中虽无记载，却由于许多野史笔记偶尔提及，如《拾遗记》、《太平广记》、《艳异编》等，渐于后世成为中国古代著名美女形象。",
  duanqiaoxiao:
    "段巧笑，三国时代魏国魏文帝时的宫人，深受到魏文帝的宠爱。传说她以原有的化妆品中的米粉和胡粉，再加入葵花子汁，发明了女性化妆用的脂粉。<br><br>段巧笑故事于正史无载，许多野史笔记偶尔提及，如晋·崔豹《古今注》、五代·马缟《中华古今注》等。",
  tianshangyi:
    "田尚衣，一作陈尚衣，魏文帝曹丕宫中著名宫人。能歌善舞，一时冠绝于世。<br><br>其事不见于《三国志》，最早见于崔豹《古今注》。",
  bailingyun:
    "柏夫人，名不详（“灵筠”为电视剧《军师联盟》虚构），三国时期曹魏权臣司马懿的宠姬，生司马懿第九子司马伦，其后司马伦在八王之乱中称帝。",
  moqiongshu:
    "莫琼树，是魏文帝曹丕宫人。莫琼树会梳理一种与众不同的“蝉鬓”发型，即将面颊两旁近耳头的头发梳成薄而翘起的形状。“望之缥缈如蝉翼”，如丝如缎，若天女下凡，令人遐想，宫中的其他女性争相仿效她的发型。",
  huaman:
    "花鬘，古典戏曲《龙凤巾》（一名《化外奇缘》）中的人物，身份为三国时期南蛮王孟获与祝融夫人的女儿，关索的夫人之一。虚构人物你还想要啥人物简介",
  zhugeguo:
    "诸葛果，传说中诸葛亮的女儿。容貌甚伟，时人异焉。出生时，野外仙气缥缈、白鹤环绕，生来天资聪慧，对道学由衷热爱。成都西南有朝真观，即乘烟观，相传，诸葛果在这里避战乱，最终修成仙道，羽化升天。",
  malingli:
    "马伶俐狗卡瞎编的名字，马超之女，其身形虽娇小，却继承了马超英勇略带冲动的个性，活泼阳光，调皮伶俐，爱摆弄爆竹烟花一类的小器具，包包里经常放置用五色彩纸包装的小炸弹球。<br><br>马伶俐从小跟随马超和马云騄学习战斗技巧，战斗力超强，坚强的意志和勇气也得到了提升，同时擅长马术，有一匹可爱的小白马伴随其身边。<br><br>后马伶俐成年，嫁与刘备之子刘理，获封梁王妃。两人琴瑟相和，极为恩爱，常结伴出游，被人誉为天作之合。<br><br>这位在历史上的记载其实就一句话：“超女配安平王理。”——《三国志·蜀书六·关张马黄赵传第六》",
  ruiji:
    "芮姬，芮玄之女。黄初六年（225年），孙权为孙登娉娶芮玄的女儿为妃。<br><br>《三国志·吴书·潘濬陆凯传第十六》：“权为子登拣择淑媛，群臣咸称玄父祉兄良并以德、义、文、武显名三世，故遂娉玄女为妃焉。”<br><br>所以这个原画和技能跟这人有什么关系吗<br><br>但确实很可爱",
  lingju:
    "灵雎，电影《铜雀台》中的虚构人物，吕布和貂蝉的女儿。虚构人物你还想要啥人物简介<br><br>在三国杀中，这是第一位能操纵身份牌的武将。",
  caoyuan:
    "曹媛《火凤燎原》编的名字，《三国演义》虚构人物，曹豹的女儿，吕布居小沛时娶为次妻，早逝且无儿女。",
}

export default characterIntro
